[
  {
    "name": "Abscondi",
    "english_title": "The Track Obliteration Charm",
    "level": 2,
    "school": "Charm",
    "ritual": true,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "Self",
    "duration": "Concentration, up to 1 hour",
    "tags": [],
    "description": "A magical aura makes your impact on your surroundings unseen, masking you and your companions from detection. For the duration, each creature you choose within 30 feet of you (including you) has a +10 bonus to Dexterity (Stealth) checks and can’t be tracked except by magical means. A creature that receives this bonus leaves behind no tracks or other traces of its passage.",
    "subclassRestricted": false
  },
  {
    "name": "Accio",
    "english_title": "The Summoning Charm",
    "level": 0,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "30 feet",
    "duration": "Instantaneous",
    "tags": [],
    "description": "A target object is pulled directly to the caster as if carried by an invisible hand. The object is selected by pointing at it with a wand or by naming it, Accio broom. An object heavier than 20 pounds may not be summoned. At Higher Levels. When you cast this spell using a spell slot of 1st level or higher, you may select or stack one of the following effects for each slot level above 0. Increase spell range by 100 feet. Increase weight limit by 20 pounds. Increase the number of targetable objects by 5.",
    "subclassRestricted": false
  },
  {
    "name": "Aguamenti",
    "english_title": "The Water-Making Spell",
    "level": 0,
    "school": "Transfiguration",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "Self (30 foot cone)",
    "duration": "Dedication, up to 1 minute",
    "tags": [],
    "description": "A cone of clear, pure water shoots from the tip of the caster's wand with the desired force. The water doesn’t go bad and extinguishes exposed flames in the area.",
    "subclassRestricted": false
  },
  {
    "name": "Alohomora",
    "english_title": "The Unlocking Charm",
    "level": 0,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "60 feet",
    "duration": "Instantaneous",
    "tags": [],
    "description": "Choose a door or window that you can see within range, that uses mundane or magical means to prevent access. A target that is held shut by a mundane lock or that is stuck or barred becomes unlocked, unstuck, or unbarred. If the object has multiple locks, only one of them is unlocked. If you choose a target that is held shut with Colloportus, that spell is removed. When you cast the spell, the mechanism noisily turns and unlocks. This noise emanates from the target object and is audible from as far away as 100 feet.",
    "subclassRestricted": false
  },
  {
    "name": "Anapneo",
    "english_title": "The Airway Clearing Spell",
    "level": 0,
    "school": "Healing",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "30 feet",
    "duration": "Instantaneous",
    "tags": ["School of Magic - Healing"],
    "description": "A being's airway is cleared and they are assisted in breathing. If used on a living being that has 0 hit points, the being becomes stable.",
    "subclassRestricted": true
  },
  {
    "name": "Appare Vestigium",
    "english_title": "The Tracking Spell",
    "level": 4,
    "school": "Divination",
    "ritual": true,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 minute",
    "range": "Self (30-foot-radius hemisphere)",
    "duration": "Concentration, up to 10 minutes",
    "tags": [],
    "description": "With a spin and a spray of golden mist, recent magical activity is revealed and illuminated through ghostly images hanging in the air, recreating the magical beings, magical creatures, or magical events that have been in the area within the last 10 minutes. Magical footprints and track marks are also highlighted on the ground. Any of the effects can be hidden, highlighted, or expanded for the duration. At Higher Levels. When you cast this spell using a spell slot of a higher level, the historical window extends to 1 hour (5th level), 24 hours (6th level), or a week (7th level).",
    "subclassRestricted": false
  },
  {
    "name": "Arania Exumai",
    "english_title": "The Spider Repelling Spell",
    "level": 2,
    "school": "Curse",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "Self (30 foot cone)",
    "duration": "Instantaneous",
    "tags": [],
    "description": "This spell blasts away spiders, Acromantulas, or arachnids with a cone of bright scorching light. Each spider-like creature in a 30-foot cone must make a Constitution saving throw. On a failed save, a creature takes 4d6 radiant damage and is knocked back 5 feet plus a number of feet equal to five times your spellcasting ability modifier. On a successful save, it takes half as much damage and isn't knocked back. Any non-arachnid creatures within the area of the spell are unaffected. At Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d6 and the shove distance increases by 10 feet for each slot level above 2nd.",
    "subclassRestricted": false
  },
  {
    "name": "Avada Kedavra",
    "english_title": "The Killing Curse",
    "level": 8,
    "school": "Curse",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "60 feet",
    "duration": "Instantaneous",
    "tags": ["Dark - Unforgivable Curse"],
    "description": "The most dangerous of the Unforgivables, Avada Kedavra channels the caster's pure hatred into an unblockable spell that kills whatever it strikes. Make a ranged spell attack against a target within range. On a hit and if the target has 100 hit points or fewer, it dies or is destroyed. Otherwise, the spell has no effect. Defensive spells have no effect against this spell and it can only be blocked by physical objects. At Higher Levels. When you cast this spell using a spell slot of 9th level, there is no hit point restriction.",
    "subclassRestricted": false
  },
  {
    "name": "Avis",
    "english_title": "The Bird-Conjuring Charm",
    "level": 3,
    "school": "Transfiguration",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "60 feet",
    "duration": "Concentration, up to 1 hour",
    "tags": [],
    "description": "You conjure either a Swarm of Small Birds or two Swarms of Tiny Birds that are a species of your choice. The swarm disappears when it drops to 0 hit points or when the spell ends. The conjured birds are friendly to you and your companions. Roll initiative for the summoned swarms as a group, which has its own turns. They obey any verbal commands that you issue to them (no action required by you). If you don't issue any commands to them, they defend themselves from hostile creatures, but otherwise take no actions. The HM has the creatures' statistics. At Higher Levels. When you cast this spell using certain higher-level spell slots, more creatures appear - twice as many with a 5th-level slot, three times as many with a 7th- level slot, and four times as many with a 9th-level slot.",
    "subclassRestricted": false
  },
  {
    "name": "Azreth",
    "english_title": "Fiendfyre",
    "level": 7,
    "school": "Curse",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "Self (10 foot cube)",
    "duration": "Dedication, up to 42 seconds",
    "tags": ["Dark"],
    "description": "Great plumes of cursed fire pour out from the tip of your wand, rampaging into shapes of beasts and incinerating anything in their path. Upon casting, the area of the fiendfyre is one 10-foot cube, with the number of 10-foot cubes doubling at the beginning of each of your turns. As long as concentration is maintained, you can arrange any newly added cubes as you wish. Each cube must have at least one face adjacent to the face of another cube. Each creature in the area must make a Dexterity saving throw. It takes 7d10 fire damage on a failed save, or half as much damage on a successful one. A creature takes the same damage when it enters the area for the first time on a turn or ends its turn there. Upon reaching 8 cubes, you must make a DC15 Constitution saving throw to maintain concentration at the beginning of each of your turns. If your concentration is broken after 4 cubes of fiendfyre are active, the spell doesn't end and rages out of control. The fiendfyre will continue to double at the beginning of each round, until the end of its duration. If you decide to end the spell while you still have concentration, the spell ends as normal and all fiendfyre disappears. The fiendfyre damages objects in the area and ignites flammable objects that aren’t being worn or carried. Even magical objects and defenses are damaged or destroyed by this spell. At Higher Levels. When you cast this spell using a spell slot of 8th level or higher, the damage increases by 2d10 and the concentration DC increases by 1 for each slot level above 7th.",
    "subclassRestricted": false
  },
  {
    "name": "Bombarda",
    "english_title": "The Exploding Charm",
    "level": 0,
    "school": "Curse",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "60 feet",
    "duration": "Instantaneous",
    "tags": ["Dark"],
    "description": "The spell blasts whatever it hits, creating a localized concussive explosion upon impact. Make a ranged spell attack against a target within range. On a hit, the target takes 1d10 bludgeoning damage. This spell’s damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10).",
    "subclassRestricted": false
  },
  {
    "name": "Brackium Emendo",
    "english_title": "The Bone Mending Spell",
    "level": 4,
    "school": "Healing",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "Touch",
    "duration": "Instantaneous",
    "tags": [],
    "description": "This spell heals a being's broken bones immediately, although the process is quite painful. A being you can see that you tap with your wand regains a number of hit points equal to 5d10 + your spellcasting ability modifier, and gains a level of exhaustion. At Higher Levels. When you cast this spell using a spell slot of 5th level or higher, the healing increases by 1d10 for each slot level above 4th.",
    "subclassRestricted": false
  },
  {
    "name": "Capacious Extremis",
    "english_title": "The Undetectable Extension Charm",
    "level": 4,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "10 minutes",
    "range": "Touch",
    "duration": "Until dispelled",
    "tags": ["School of Magic - Charms"],
    "description": "Transform an ordinary small bag/pouch into a Handy Haversack's central pouch, a backpack into a Bag of Holding, or a trunk’s internal capacity into a Bag of Holding with: 3 ft. long and 2 ft. wide opening; internal size of 6 ft. long, 4 ft. wide, and 4 ft. deep; 1000 pounds and 150 cubic ft. limits.",
    "subclassRestricted": true
  },
  {
    "name": "Capto",
    "english_title": "The Gripping Charm",
    "level": 0,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "Touch",
    "duration": "10 minutes",
    "tags": [],
    "description": "One target object becomes quite easily gripped by one hand, almost sticky unless the holder willfully lets go. The holder has advantage against being non-magically disarmed.",
    "subclassRestricted": false
  },
  {
    "name": "Carpe Retractum",
    "english_title": "The Seize and Pull Charm",
    "level": 0,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "60 feet",
    "duration": "1 round",
    "tags": [],
    "description": "A bond of light shoots out from the caster and attaches to anything you can see within range, and then retracts, pulling caster and target each 10 feet closer. If the caster or target doesn't move or would easily resist the force of the other being pulled, the other moves 20 feet. If the target is an unwilling creature that is able to be moved, it must make a Strength saving throw to resist being moved. The bond of light keeps the caster and target attached for the duration. At Higher Levels. When you cast this spell using a spell slot of 1st level or higher, the range and pulling effect both increase by 5 feet for each slot level above 0.",
    "subclassRestricted": false
  },
  {
    "name": "Cave Inimicum",
    "english_title": "The Hiding Charm",
    "level": 5,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 minute",
    "range": "Self (10-foot-radius hemisphere)",
    "duration": "1 hour",
    "tags": ["Defensive"],
    "description": "A forcefield-like dome forms a perimeter around the caster that filters vision of anything or anyone designated by the caster, rendering those objects infallibly invisible. The dome is undetectable from the outside, but slightly visible from the inside, like a wavering glass barrier. Anyone can move through the field freely to see the hidden contents. At Higher Levels. When you cast this spell using a spell slot of 6th level or higher, you may select or stack one of the following effects for each slot level above 5th. Increase the spell radius by 20 feet. Increase the duration to 8 hours. Add the ability to completely block sounds. Add the ability to completely block smells.",
    "subclassRestricted": false
  },
  {
    "name": "Cistem Aperio",
    "english_title": "The Container Opening Charm",
    "level": 0,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "60 feet",
    "duration": "Instantaneous",
    "tags": [],
    "description": "Choose a box, chest, or another container that you can see within range that uses mundane or magical means to prevent access. A target that is held shut by a mundane lock or that is stuck or chained becomes unlocked, unstuck, or unchained. If the object has multiple locks, only one of them is unlocked. If you choose a target that is held shut with Colloportus, that spell is dispelled. When you cast the spell, the mechanism noisily turns and unlocks. This noise emanates from the target object and is audible from as far away as 100 feet.",
    "subclassRestricted": false
  },
  {
    "name": "Colloportus",
    "english_title": "The Locking Spell",
    "level": 0,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "Touch",
    "duration": "Until dispelled",
    "tags": [],
    "description": "You touch a closed door, window, gate, chest, or other entryway, and it becomes locked for the duration. It is impassable until it is broken or the spell is dispelled or suppressed. While affected by this spell, the object is more difficult to break or force open; the DC to break it or pick any locks on it increases by 10.",
    "subclassRestricted": false
  },
  {
    "name": "Colloshoo",
    "english_title": "The Stickfast Hex",
    "level": 1,
    "school": "Curse",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "90 feet",
    "duration": "Concentration, up to 1 minute",
    "tags": [],
    "description": "This creative hex sticks a being's shoes to the ground, rooting them in place. Choose a being you can see within range that is wearing shoes to make a Dexterity saving throw. On a failed save, the target is restrained for the duration. If the saving throw fails by 5 or more, the target is knocked prone as well. The target can use its action to take off its shoes, or make a Strength check against your spell save DC. On a success, it pulls its shoes free.",
    "subclassRestricted": false
  },
  {
    "name": "Confringo",
    "english_title": "The Blasting Curse",
    "level": 3,
    "school": "Curse",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "90 feet",
    "duration": "Instantaneous",
    "tags": ["Dark"],
    "description": "A tiny ball of fire flashes from your wand to a point you choose within range and then explodes into a fiery blast on impact. Each creature in a 10-foot-radius sphere centered on that point must make a Dexterity saving throw. A target takes 8d6 fire damage on a failed save, or half as much damage on a successful one. The fire spreads around corners. It ignites flammable objects in the area that aren’t worn or carried. At Higher Levels. When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d6 and the radius increases by 5 feet for each slot level above 3rd.",
    "subclassRestricted": false
  },
  {
    "name": "Confundo",
    "english_title": "The Confundus Charm",
    "level": 4,
    "school": "Charm",
    "ritual": true,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "90 feet",
    "duration": "Concentration, up to 1 minute",
    "tags": [],
    "description": "The Confundus Charm is a particularly powerful charm that leaves anything confused, forgetful, and impressionable, often causing people to wander off absent-mindedly. If the target is an object you can see within range that operates or functions on its own, it will operate erratically, malfunction, or completely shut down. This spell has no effect on a completely inanimate objects that entirely depend on external manipulation. If the target is a creature you can see within range, it must succeed on a Wisdom saving throw when you cast this spell or be affected by it. An affected target can’t take reactions and, if not distracted with something, you roll a d10. If you roll 1-8, the creature must use all its movement to move in a random direction. To determine the direction, assign a direction to each number 1-8. If you roll a 9-10, the creature doesn't move. Whether it moves or not, the creature doesn’t take an action this turn. If desired, you can suggest a course of activity (limited to a sentence or two) at the time of casting and magically influence a creature you can see within range that can hear and understand you. Creatures that can’t be charmed are immune to this effect. The suggestion must be worded in such a manner as to make the course of action sound reasonable. Asking the creature to directly hurt itself or its allies will have no effect. The suggested course of action can continue for the entire duration. You can also specify conditions that will trigger a special activity during the duration. For example, you might suggest that a wizard hug the next blast-ended skrewt he sees. If the condition isn’t met before the spell expires, the activity isn’t performed. At the end of each of its turns, an affected target can make a Wisdom saving throw. If it succeeds, the spell's effects end for that target. At Higher Levels. When you cast this spell using a spell slot of 5th level or higher, you can target one additional target for each slot level above 4th. The targets must be within 30 feet of each other when you target them.",
    "subclassRestricted": false
  },
  {
    "name": "Conjunctivia",
    "english_title": "The Conjunctivitis Curse",
    "level": 3,
    "school": "Curse",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "60 feet",
    "duration": "1 minute",
    "tags": [],
    "description": "When struck by this curse, a creature's eyes to become irritated and painful, swelling shut. Make a ranged spell attack against a creature within range. On a hit, the target takes 4d8 necrotic damage and is blinded for the duration. At the end of each of its turns, the target can make a Constitution saving throw. On a success, the spell ends. Creatures that are normally magically resistant are vulnerable to this spell. At Higher Levels. When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d8 for each slot level above 3rd.",
    "subclassRestricted": false
  },
  {
    "name": "Crinus Muto",
    "english_title": "The Haircut Spell",
    "level": 0,
    "school": "Transfiguration",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "Self",
    "duration": "1 hour",
    "tags": [],
    "description": "Your hair is magically lengthened, shortened, styled, or colored. This may also be applied to eyebrows and facial hair. If your appearance is drastically changed, you may be hard to recognize. To discern that you are disguised, a creature can use its action to inspect your appearance and must succeed on an Intelligence (Investigation) check against your spell save DC.",
    "subclassRestricted": false
  },
  {
    "name": "Defodio",
    "english_title": "The Gouging Spell",
    "level": 0,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "30 feet (5 foot cube)",
    "duration": "Instantaneous",
    "tags": [],
    "description": "You choose a portion of dirt or stone that you can see with range and that fits within a 5-foot cube. You manipulate it in one of the following ways: If you target an area of stone or earth, you can instantaneously excavate it, move it along the ground, and deposit it up to 5 feet away. This movement doesn’t have enough force to cause damage. If the dirt or stone you target is on the ground, you cause it to become difficult terrain. Alternatively, you can cause the ground to become normal terrain if it is already difficult terrain. This change lasts for 1 hour. If cast multiple times, only two of this effect can be active at a time, and you can dismiss such an effect as a bonus action. At Higher Levels. When you cast this spell using a spell slot of 1st level or higher, the cube's size and distance the earth can be moved are each increased by 5 feet and the number of active normal/difficult terrain effects increase by 1 for each slot level above 0.",
    "subclassRestricted": false
  },
  {
    "name": "Densaugeo",
    "english_title": "The Bucktooth Hex",
    "level": 1,
    "school": "Curse",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "60 feet",
    "duration": "Instantaneous",
    "tags": [],
    "description": "A target's front two teeth grow abnormally long, protruding downwards past its chin. Make a ranged spell attack against a creature within range. On a hit, it takes 2d8 psychic damage and has disadvantage on the next attack roll it makes before the end of its next turn. At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the damage is increased by 1d8 for each slot level above 1st.",
    "subclassRestricted": false
  },
  {
    "name": "Deprimo",
    "english_title": "The Crushing Charm",
    "level": 3,
    "school": "Charm",
    "ritual": true,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "120 feet",
    "duration": "Instantaneous",
    "tags": [],
    "description": "You place immense downward pressure on a target you can see within range. If the target is a creature, it must make a Strength saving throw. On a failed save, a creature takes 5d8 bludgeoning damage and is knocked prone. On a successful save, the creature takes half as much damage and isn’t knocked prone. If the target is a flat surface, this will either create a crater or collapse the surface. At Higher Levels. When you cast this spell using a spell slot of 4th level or higher, the damage is increased by 1d8 for each slot level above 3rd.",
    "subclassRestricted": false
  },
  {
    "name": "Depulso",
    "english_title": "The Banishing Charm",
    "level": 3,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "60 feet",
    "duration": "Instantaneous",
    "tags": [],
    "description": "A target within range is pushed directly away from the caster as if shoved by an invisible hand, being thrown 5 feet away plus a number of feet equal to five times your spellcasting ability modifier. The target is selected by the caster pointing at it with their wand. If targeting a creature or object that is being worn or carried, make a check with 26 Strength (+8) contested by the Strength (Athletics) check of the target creature. If the target is Medium or smaller, you have advantage on the check. If you succeed, the target is thrown the same distance. At Higher Levels. When you cast this spell using a spell slot of 4th level or higher, the shove distance is increased by 10 feet for each slot level above 3rd.",
    "subclassRestricted": false
  },
  {
    "name": "Devicto",
    "english_title": "The Stinging Jinx",
    "level": 0,
    "school": "Curse",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "60 feet",
    "duration": "Instantaneous",
    "tags": [],
    "description": "This weak jinx is a classic training spell between duelists, a startling sting on impact. Make a ranged spell attack against a creature within range. On a hit, it takes 1d6 force damage, and it can't take reactions until the start of its next turn. The spell's damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6).",
    "subclassRestricted": false
  },
  {
    "name": "Digitus Wibbly",
    "english_title": "The Jelly-Fingers Jinx",
    "level": 1,
    "school": "Curse",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "60 feet",
    "duration": "1 minute",
    "tags": [],
    "description": "This jinx makes fingers numb and relaxed. Make a ranged spell attack against a being within range. On a hit, the target has disadvantage on attack rolls for the duration. At the start of each of its turns, the target can make a Dexterity saving throw. On a success, the spell ends.",
    "subclassRestricted": false
  },
  {
    "name": "Diminuendo",
    "english_title": "The Diminishing Charm",
    "level": 2,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "60 feet",
    "duration": "Concentration, up to 1 minute",
    "tags": [],
    "description": "Make a ranged spell attack against a creature within range. On a hit, the being or beast's size is halved in all dimensions, and its weight is reduced to one-eighth of normal. This reduction decreases its size by one category - from Medium to Small, for example. Until the spell ends, the target also has disadvantage on Strength checks and Strength saving throws. The target's items or equipment also shrink to match its new size, but any item dropped by an affected creature returns to normal size at once. The target deals 1d4 less damage (this can't reduce the damage below 1).",
    "subclassRestricted": false
  },
  {
    "name": "Dissonus Ululatus",
    "english_title": "The Caterwauling Charm",
    "level": 3,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "10 minutes",
    "range": "Self (30-foot-radius hemisphere)",
    "duration": "8 hours",
    "tags": ["Defensive"],
    "description": "You set an alarm to emit a piercing shriek when an unauthorized person enters the area. Until the spell ends, an alarm sounds whenever a Tiny or larger creature touches or enters the warded area. When you cast the spell, you can designate creatures or areas within the hemisphere that won't set off the alarm. The alarm produces an unpleasant screaming sound for as long as the intruding creature is in the area of the spell, audible from as far away as 300 feet.",
    "subclassRestricted": false
  },
  {
    "name": "Draconifors",
    "english_title": "The Dragon-Making Spell",
    "level": 5,
    "school": "Transfiguration",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "30 feet",
    "duration": "Concentration, up to 10 minutes",
    "tags": [],
    "description": "A particularly intimidating display of transfiguration, this spell turns a desk-sized object into a miniature version of an adult dragon. Choose either one or two inanimate, nonmagical objects you can see within range that each fill a 5-foot cube and choose one of the following options: One dragon wyrmling of challenge rating 4 or lower Two dragon wyrmlings of challenge rating 2 or lower The object becomes a Medium-sized dragon construct with the chosen wyrmling's statistics, which is untransfigured when it drops to 0 hit points or when the spell ends. The dragon construct is friendly to you and your companions for the duration. Roll initiative for the dragon construct, which has its own turns. It obeys any verbal commands that you issue to it (no action required by you). If you don't issue any commands to it, it defends itself from hostile creatures, but otherwise takes no actions. If your concentration is broken, the dragon construct doesn't disappear. Instead, you lose control of the construct, it becomes hostile toward you and your companions, and it might attack. An uncontrolled dragon construct can't be dismissed by you, and it untransfigures 10 minutes after you transfigured it. The HM has the creature's statistics. At Higher Levels. When you cast this spell using a spell slot of 7th level, choose one of the following options: Two dragon wyrmlings of challenge rating 3 or lower Three dragon wyrmlings of challenge rating 2 or lower When you cast this spell using a spell slot of 9th level, choose one of the following options: Two dragon wyrmlings of challenge rating 4 or lower Four dragon wyrmlings of challenge rating 2 or lower",
    "subclassRestricted": false
  },
  {
    "name": "Duro",
    "english_title": "The Hardening Charm",
    "level": 0,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "60 feet",
    "duration": "1 minute",
    "tags": [],
    "description": "An object you can see within range becomes as hard and tough as stone. It gains resistance to all damage.",
    "subclassRestricted": false
  },
  {
    "name": "Engorgio",
    "english_title": "The Engorgement Charm",
    "level": 2,
    "school": "Charm",
    "ritual": true,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "Touch",
    "duration": "1 minute",
    "tags": [],
    "description": "You cause a creature or an object you can see within range to grow larger for the duration. Choose either a creature or an object that isn’t being worn or carried. If the target is unwilling, it can make a Constitution saving throw. On a success, the spell has no effect. The target's size doubles in all dimensions, and its weight is multiplied by eight. This growth increases its size by one category - from Medium to Large, for example. If there isn't enough room for the target to double its size, the creature or object attains the maximum possible size in the space available. Until the spell ends, the target also has advantage on Strength checks and Strength saving throws. The target's items and equipment also grow to match its new size. While enlarged, the target deals 1d4 extra damage.",
    "subclassRestricted": false
  },
  {
    "name": "Episkey",
    "english_title": "The Fast-Healing Spell",
    "level": 1,
    "school": "Healing",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 bonus action",
    "range": "10 feet",
    "duration": "Instantaneous",
    "tags": [],
    "description": "A being of your choice that you can see within range regains hit points equal to 2d4 + your spellcasting ability modifier. This spell has no effect on undead or constructs. At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the healing increases by 1d4 for each slot level above 1st.",
    "subclassRestricted": false
  },
  {
    "name": "Epoximise",
    "english_title": "The Sticking Spell",
    "level": 0,
    "school": "Transfiguration",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "30 feet",
    "duration": "1 hour",
    "tags": [],
    "description": "This spell transfigures the surface of an object to become extremely sticky. One object of your choice that you can see within range and that fits within a 1-foot cube adheres to anything it touches for the duration. If a creature wants to overcome the sticking effect, it can use its action to make a Strength check against your spell save DC. On a success, it can pull the target object free or remove one thing from the target object's surface. At Higher Levels. When you cast this spell using a spell slot of 1st level or higher, the cube's size increases by 1 foot for each slot level above 0.",
    "subclassRestricted": false
  },
  {
    "name": "Evanesco",
    "english_title": "The Vanishing Spell",
    "level": 3,
    "school": "Transfiguration",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "30 ft",
    "duration": "Instantaneous",
    "tags": [],
    "description": "One non-magical object or magical construct of your choice that you can see within range and that fits within a 1-foot cube is vanished. Vanished objects have been described as being transfigured to go 'into non-being, which is to say, everything.' Vanishing is often seen as the magical inverse of conjuration. At Higher Levels. When you cast this spell using a spell slot of 4th level or higher, the cube's size increases by 1 foot for each slot level above 3rd.",
    "subclassRestricted": false
  },
  {
    "name": "Exhilaro",
    "english_title": "The Cheering Charm",
    "level": 1,
    "school": "Charm",
    "ritual": true,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "30 feet",
    "duration": "Concentration, up to 1 minute",
    "tags": [],
    "description": "A creature of your choice that you can see within range becomes quite cheerful. For the next 10 minutes, the target creature has advantage on any saving throw against becoming frightened. If concentration is maintained for one whole round, the creature perceives everything as hilariously funny and falls into fits of laughter if this spell affects it. The target must succeed on a Wisdom saving throw or fall prone, becoming incapacitated and unable to stand up for the duration. A creature with an Intelligence score of 5 or less isn’t affected. At the end of each of its turns, and each time it takes damage, the target can make another Wisdom saving throw. The target has advantage on the saving throw if it’s triggered by damage. On a success, the spell ends.",
    "subclassRestricted": false
  },
  {
    "name": "Expelliarmus",
    "english_title": "The Disarming Charm",
    "level": 2,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "60 feet",
    "duration": "Instantaneous",
    "tags": [],
    "description": "Famous for being the spell that finally defeated Voldemort in the Second Wizarding War, this spell can harmlessly end duels by disarming a wizard of his wand. Make a ranged spell attack against a being within range. On a hit, you disarm the target, forcing it to drop one item of your choice that it's holding. The object lands 10 feet away from it in a random direction. At Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, you can choose the direction the object travels and the object's distance increases by 10 feet for each slot level above 2nd.",
    "subclassRestricted": false
  },
  {
    "name": "Ferula",
    "english_title": "The Bandaging Charm",
    "level": 1,
    "school": "Healing",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "30 feet",
    "duration": "10 minutes",
    "tags": [],
    "description": "Bandages and splints are conjured on a being you can see within range, with no more than half of its hit point maximum, and it gains hit points equal to two times your spellcasting ability modifier. Additionally, any Wisdom (Medicine) checks to stabilize that target within the duration are made at advantage, and if the target is successfully stabilized, it regains 1 hit point.",
    "subclassRestricted": false
  },
  {
    "name": "Fianto Duri",
    "english_title": "The Reinforcing Charm",
    "level": 3,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "90 feet",
    "duration": "Instantaneous",
    "tags": ["Defensive"],
    "description": "Whenever you cast this spell on an active defensive spell within range that improves a creature’s AC or grants it temporary hit points, each creature affected by the targeted spell gains temporary hit points equal to twice your caster level + your spellcasting ability modifier. When the targeted spell ends or an affected creature is no longer affected by it, the creature loses any remaining temporary hit points from this spell. If you are maintaining concentration or dedication on a defensive spell, this spell can uniquely be cast on that active defensive spell without ending that spell or breaking your concentration or dedication.",
    "subclassRestricted": false
  },
  {
    "name": "Fidelius Mysteria Celare",
    "english_title": "The Fidelius Charm",
    "level": 9,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 hour",
    "range": "Self (150-foot-radius hemisphere)",
    "duration": "Until dispelled",
    "tags": [],
    "description": "When cast upon a single dwelling that fits within range, it becomes a secret, infallibly invisible and inaccessible by anyone else. This effect reaches to the dwelling's property lines, or if no property lines are defined, the edge of the hemisphere centered on the caster at the time of casting.",
    "subclassRestricted": true
  },
  {
    "name": "Finestra",
    "english_title": "The Glass-Shattering Charm",
    "level": 0,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "10 feet",
    "duration": "Instantaneous",
    "tags": [],
    "description": "A pane of glass you can see within range turns to powder, discreetly turning it into an open entryway.",
    "subclassRestricted": false
  },
  {
    "name": "Finite Incantatem",
    "english_title": "The General Counter-spell",
    "level": 2,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "30 feet",
    "duration": "Instantaneous",
    "tags": ["Defensive"],
    "description": "Choose any creature, object, or magical effect within range. One non-Transfiguration spell of 2nd level or lower on the target ends. If you are aware of at least one spell affecting the target, you can specify that spell in your mind. If you are unaware of what spells are affecting the target, one randomly selected spell ends. For a spell of a higher level on the target, make an ability check using your spellcasting ability. The DC equals 10 + the spell's level. On a successful check, the spell ends. At Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, you automatically end the effects of a non-Transfiguration spell on the target if the spell's level is equal to or less than the level of the spell slot you used.",
    "subclassRestricted": false
  },
  {
    "name": "Flagrate",
    "english_title": "The Lettering Charm",
    "level": 0,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "Touch",
    "duration": "Until dispelled",
    "tags": [],
    "description": "You trace your wand in the air or over an object, leaving fiery marks in that position. You may write any letters or depict any shapes, as if you were writing with a quill. Although the glowing letters appear to be made of fire, it is just an illusion and it cannot burn anything.",
    "subclassRestricted": false
  },
  {
    "name": "Fortissimum",
    "english_title": "The Unbreakable Charm",
    "level": 3,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "Touch",
    "duration": "Until dispelled",
    "tags": [],
    "description": "One object of your choice that you can see within range and that fits within a 1-foot cube is made completely invulnerable to physical destruction. This renders it immune to any damage, magical or mundane, but it can still be affected by spells that directly change the object, such as vera verto or evanesco. At Higher Levels. When you cast this spell using a spell slot of 4th level or higher, the cube's size increases by 1 foot for each slot level above 3rd.",
    "subclassRestricted": false
  },
  {
    "name": "Fumos",
    "english_title": "The Smokescreen Spell",
    "level": 2,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "Self (15 foot cube)",
    "duration": "Concentration, up to 1 minute",
    "tags": [],
    "description": "A thick spray of smoke billows out from your wand, filling a 15-foot cube originating from you. This smoke spreads around corners. It lasts for the duration or until strong wind disperses the smoke, ending the spell. Its area is heavily obscured. When a creature enters the spell's area for the first time on a turn or starts its turn there, that creature must make a Constitution saving throw. The creature takes 3d6 poison damage on a failed save, or half as much damage on a successful one. Constructs and undead are immune to this damage. At Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 2d6 and the area increases by 5 feet for each slot level above 2nd.",
    "subclassRestricted": false
  },
  {
    "name": "Furnunculus",
    "english_title": "The Pimple Jinx",
    "level": 0,
    "school": "Curse",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "60 feet",
    "duration": "Instantaneous",
    "tags": [],
    "description": "Outbreaks of this jinx is a common occurrence when students get in fights, resulting in grotesque pimples covering the victims face. Make a ranged spell attack against a being within range. On a hit, it takes 1d4 psychic damage and has disadvantage on the next attack roll it makes before the end of its next turn. Additionally, it has disadvantage on the next Charisma ability check it makes. This spell’s damage increases by 1d4 when you reach 5th level (2d4), 11th level (3d4), and 17th level (4d4).",
    "subclassRestricted": false
  },
  {
    "name": "Geminio",
    "english_title": "The Doubling Charm",
    "level": 2,
    "school": "Charm",
    "ritual": true,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "Touch",
    "duration": "10 days",
    "tags": [],
    "description": "You tap an object that fits within a 1-foot cube with your wand and a perfect duplicate of it pops out from the object. The duplicate is indistinguishable from the object by normal means, but does not share any of its magical qualities or functions. The duplicate has one quarter of the original object's hit points and vanishes at the end of the spell's duration. To detect the duplicate's inauthenticity, a creature within 5 feet of it can use an action to make an Intelligence (Investigation) check against your spell save DC. On a success, it perceives subtle flaws and understands it to be a fake. 5 days after casting this spell, the duplicate begins to show significant signs of degradation, granting advantage on the Investigation check. If specialis revelio is cast on the duplicate, the caster is made aware that the object is a duplicate created by this spell. At Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, the cube's size increases by 1 foot for each slot level above 2nd.",
    "subclassRestricted": false
  },
  {
    "name": "Genu Recurvatum",
    "english_title": "The Knee-Reversal Hex",
    "level": 0,
    "school": "Curse",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "60 feet",
    "duration": "1 minute",
    "tags": [],
    "description": "This hex flips around a beast or being's knees, forcing them to take awkward, uncoordinated steps. Make a ranged spell attack against a creature within range. On a hit, the target's speed is halved for the duration of the spell.",
    "subclassRestricted": false
  },
  {
    "name": "Glacius",
    "english_title": "The Water-Freezing Charm",
    "level": 1,
    "school": "Charm",
    "ritual": true,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "60 feet",
    "duration": "1 hour",
    "tags": [],
    "description": "You freeze an area of water that you can see within range and that fits within a 5-foot cube. The area becomes difficult terrain for the duration. Each Medium or smaller creature that is covered, submerged or partially submerged in the affected water has its speed halved and must make a Constitution saving throw. On a failed save, a creature takes 3d8 cold damage, or half as much damage on a successful one. At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d8 and the cube's size increases by 5 feet for each slot level above 1st. If a creature of any size fits within the larger cube, it can be affected by this spell.",
    "subclassRestricted": false
  },
  {
    "name": "Glisseo",
    "english_title": "The Stairs-to-Slide Charm",
    "level": 0,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "30 feet",
    "duration": "Concentration, up to 1 minute",
    "tags": [],
    "description": "Famously used to protect the Hogwarts girls' dormitories from intruders, this spell changes the angle of all connected steps in a single flight of stairs within range. They angle downwards, turning into an abnormally slick ramp.",
    "subclassRestricted": false
  },
  {
    "name": "Herbivicus",
    "english_title": "The Gardening Charm",
    "level": 3,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action or 1 minute",
    "range": "90 feet",
    "duration": "1 hour or Instantaneous",
    "tags": [],
    "description": "This spell channels vitality into plants within a specific area. There are two possible uses for the spell, granting either immediate or long-term benefits. If you cast this spell using 1 action, choose a point within range. All non-magical plants in a 60-foot radius centered on that point become thick and overgrown for 1 hour, turning the area into difficult terrain. These plants can't be used in potions, due to being magically manipulated. If you cast this spell over 1 minute, you accelerate the growth of a single young plant you can see within range, magical or mundane. The plant instantly reaches maturity, but does not exceed a healthy \"adult\" size.",
    "subclassRestricted": false
  },
  {
    "name": "Homenum Revelio",
    "english_title": "The Human-Presence-Revealing Spell",
    "level": 4,
    "school": "Divination",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "Self (60 foot sphere)",
    "duration": "Instantaneous",
    "tags": [],
    "description": "You sense the presence and general direction of each human or magical being within range. If any being is moving, you know its direction. If the being is transfigured into a beast or object, this spell won’t sense that being. A being is alerted to being detected by this spell, as the spell produces an odd feeling of something standing right behind you or over you.",
    "subclassRestricted": false
  },
  {
    "name": "Ignis Furore",
    "english_title": "The Firestorm Spell",
    "level": 6,
    "school": "Transfiguration",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "60 feet",
    "duration": "Concentration, up to 1 minute",
    "tags": ["Dark"],
    "description": "You create a ringed wall of fire within range up to 20 feet in diameter, 20 feet high, and 10 feet thick choosing whether it's touching the ground or in the air. The wall is opaque and lasts for the duration. When the wall appears, each creature within its area must make a Dexterity saving throw. On a failed save, a creature takes 4d8 fire damage, or half as much damage on a successful save. A creature takes the same damage when it enters the wall for the first time on a turn or ends its turn there. As an action, you can send a tendril of flames lashing out at any point within 60 feet of the center of the ring. Each creature within 5 feet of that point must make a Dexterity saving throw. A creature takes 4d8 fire damage on a failed save, or half as much damage on a successful one. A creature in the area of the wall and fiery burst is affected only once. The spell damages objects in the area and ignites flammable objects that aren’t being worn or carried. At Higher Levels. When you cast this spell using a spell slot of 7th level or higher, the damage increases by 1d8 and the ring's radius increases by 5 feet for each slot level above 6th.",
    "subclassRestricted": false
  },
  {
    "name": "Ignis Laqueis",
    "english_title": "The Fire Whip Spell",
    "level": 3,
    "school": "Transfiguration",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "60 feet",
    "duration": "Dedication, up to 1 minute",
    "tags": ["School of Magic - Transfiguration"],
    "description": "You create a long, snaking whip of fire from the tip of your wand, lashing out and coiling around a creature in range. Make a melee spell attack against the target. On a hit, the creature takes 4d10 fire damage and is grappled for the duration. As an action, the target can make a Strength or Dexterity saving throw to end the spell's effects. On each of your following turns spent maintaining dedication, the whip tightens and you deal 4d10 fire damage to the target automatically. If the creature is Large or smaller, you can use a bonus action to pull the creature up to 10 feet closer to you. At Higher Levels. When you cast this spell using a spell slot of 4th level or higher, the initial damage and subsequent turn damage increases by 1d10 for each slot level above 3rd.",
    "subclassRestricted": true
  },
  {
    "name": "Illegibilus",
    "english_title": "The Word-Scrambling Charm",
    "level": 0,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "10 feet",
    "duration": "1 hour",
    "tags": [],
    "description": "For the duration, no one can understand any written language that the spell is cast upon. The pieces of all the letters are separated and scrambled, rendering it impossible to try to decode.",
    "subclassRestricted": false
  },
  {
    "name": "Impedimenta",
    "english_title": "The Impediment Jinx",
    "level": 3,
    "school": "Curse",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "60 feet",
    "duration": "1 minute",
    "tags": [],
    "description": "A powerful dueling spell, this jinx alters time around one creature you can see within range, severely inhibiting its ability in combat. The target must succeed on a Wisdom saving throw or be affected by this spell for the duration. An affected target's speed is halved, it takes a -2 penalty to AC and Dexterity saving throws, and it can't use reactions. On its turn, it can use either an action or a bonus action, not both. Regardless of the creature's abilities or magic items, it can't make more than one melee or ranged attack during its turn. If the creature attempts to cast a spell with a casting time of 1 action, roll a d20. On an 11 or higher, the spell doesn't take effect until the creature's next turn, and the creature must use its action on that turn to complete the spell. If it can't, the spell is wasted. A creature affected by this spell makes another Wisdom saving throw at the end of its turn. On a successful save, the effect ends for it.",
    "subclassRestricted": false
  },
  {
    "name": "Imperio",
    "english_title": "The Imperius Curse",
    "level": 5,
    "school": "Curse",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "10 feet",
    "duration": "Concentration, up to 1 minute",
    "tags": ["Dark - Unforgivable Curse"],
    "description": "When this Unforgivable Curse is cast, an incredibly wonderful, floating feeling comes over the victim, granting them a feeling of \"untraceable happiness\" and peace. In this state, the person's will is completely overridden by the caster and they will follow any command. A being of your choice within range must succeed on a Charisma saving throw at disadvantage or be charmed by you for the duration. While the target is charmed, you have a telepathic link with it. You can use this telepathic link to issue commands to the creature while you are conscious (no action required), which it does its best to obey. You can specify a simple and general course of action, such as “Attack that creature,” “Run over there,” or “Fetch that object.” If the creature completes the order and doesn’t receive further direction from you, it defends and preserves itself to the best of its ability. You can use your action to take total and precise control of the target. Until the end of your next turn, the creature takes only the actions you choose, and doesn’t do anything that you don’t allow it to do. During this time you can also cause the creature to use a reaction, but this requires you to use your own reaction as well. Each time the target takes damage, it makes a new Charisma saving throw at disadvantage against the spell. If the saving throw succeeds, the spell ends. At Higher Levels. When you cast this spell using a higher level spell slot, the duration is concentration, up to 10 minutes (6th level), up to 1 hour (7th level), up to 8 hours (8th level), or until dispelled with no concentration (9th level).",
    "subclassRestricted": false
  },
  {
    "name": "Impervius",
    "english_title": "The Waterproofing Charm",
    "level": 0,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "Touch",
    "duration": "1 hour",
    "tags": [],
    "description": "For the duration, a target object that you can see within range is waterproof and completely protected from any gas. It's as if any liquid or gas runs into a magnetic field around the object by which it is repelled, but the spell has no effect against solids impacting the target object.",
    "subclassRestricted": false
  },
  {
    "name": "Inanimatus Conjurus",
    "english_title": "Conjuration Incantation",
    "level": 1,
    "school": "Transfiguration",
    "ritual": true,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "10 feet",
    "duration": "1 hour",
    "tags": [],
    "description": "You conjure up an inanimate object in your hand or in an unoccupied space within range that you can see. This object can be no larger than 2 feet on a side and weigh no more than 10 pounds, and its form must be that of a nonmagical object that you have seen. The object disappears at the end of the spell's duration or if it takes any damage. At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, you may select or stack one of the following effects for each slot level above 1st. Increase the side length by 2 feet. Increase the weight limit by 10 pounds.",
    "subclassRestricted": false
  },
  {
    "name": "Incendio",
    "english_title": "The Fire-Making Spell",
    "level": 1,
    "school": "Transfiguration",
    "ritual": true,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "90 feet",
    "duration": "Concentration, up to 1 minute",
    "tags": ["Dark"],
    "description": "You create a bonfire on ground that you can see within range. Until the spell ends, the bonfire fills a 5-foot cube. Any creature in the bonfire’s space when you cast the spell must succeed on a Dexterity saving throw. It takes 3d6 fire damage on a failed save, or half as much damage on a successful one. A creature must also make the saving throw when it moves into the bonfire’s space for the first time on a turn or ends its turn there. The bonfire ignites flammable objects in its area that aren’t being worn or carried. If there is adequate fuel for the bonfire to burn, it will continue burning after the spell ends. At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 2d6 for each slot level above 2nd.",
    "subclassRestricted": false
  },
  {
    "name": "Incendio Glacia",
    "english_title": "The Bluebell Flames Spell",
    "level": 0,
    "school": "Transfiguration",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "Touch",
    "duration": "1 hour",
    "tags": [],
    "description": "A flickering blue flame flows out from the tip of your wand, condensing on an object, in a container, or in your hand. The flame remains there for the duration and only emanates heat directly upwards. It doesn't harm anything beneath or around it, and seems to hover slightly above whatever it's resting upon. If placed beneath a flammable object, a natural fire may be started from the heat. The flame sheds bright light in a 10-foot radius and dim light for an additional 10 feet. The spell ends if you dismiss it as a bonus action.",
    "subclassRestricted": false
  },
  {
    "name": "Infirma Cerebra",
    "english_title": "The Jelly-Brain Jinx",
    "level": 0,
    "school": "Curse",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "60 feet",
    "duration": "1 round",
    "tags": [],
    "description": "This jinxes a target's mind, giving them a brief moment of disorientation. Make a ranged spell attack against a creature within range. On a hit, the target takes 1d6 psychic damage, and the first time it makes a saving throw before the end of your next turn, it must roll a d4 and subtract the number rolled from the save. This spell’s damage increases by 1d6 when you reach certain levels: 5th level (2d6), 11th level (3d6), and 17th level (4d6).",
    "subclassRestricted": false
  },
  {
    "name": "Intus Sunt",
    "english_title": "The Entrail-Expelling Curse",
    "level": 3,
    "school": "Healing",
    "ritual": true,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "30 feet",
    "duration": "Concentration, up to 1 minute",
    "tags": ["School of Magic - Healing"],
    "description": "Invented by Urquhart Rackharrow, this medieval remedy causes the recipient to purge and experience great abdominal pain. Choose one being that you can see within range to make a Constitution saving throw. If it fails, the target's exhaustion is set to 2 levels for the duration. At the end of each of its turns, the target can make a Constitution saving throw, without disadvantage from exhaustion. On a success, the spell ends. If the target has higher levels of exhaustion than the spell's effect, the spell does not change its levels of exhaustion. If the target gains any levels of exhaustion within the duration of this spell, it stacks with this spell's effect. Additionally, if the target is suffering any condition or negative effects from something it ingested, such as drinking a poison, this spell ends those effects. At Higher Levels. If you cast this spell using a spell slot of 6th level or higher, the target's exhaustion is set to 3 levels (6th level), 4 levels (7th level), or 5 levels (8th level).",
    "subclassRestricted": true
  },
  {
    "name": "Langlock",
    "english_title": "The Gagging Jinx",
    "level": 3,
    "school": "Curse",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action or reaction, which you take when you see a creature within 60 feet of you casting a spell",
    "range": "60 feet",
    "duration": "1 round",
    "tags": ["School of Magic - Jinxes, Hexes, and Curses"],
    "description": "You attempt to interrupt a being you can see in the process of casting a spell. If the creature is verbally casting a spell of 3rd level or lower, its spell fails and has no effect. If it is verbally casting a spell of 4th level or higher, make an ability check using your spellcasting ability. The DC equals 10 + the spell’s level. On a success, the creature’s spell fails and has no effect.",
    "subclassRestricted": true
  },
  {
    "name": "Legilimens",
    "english_title": "The Legilimency Spell",
    "level": 3,
    "school": "Divination",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "60 feet",
    "duration": "Concentration, up to 1 minute",
    "tags": ["School of Magic - Divination"],
    "description": "With legilimency, a being's eyes become windows to their mind, showing you a vision of their thoughts. For the duration, you can read the thoughts of a being you can see within range, as soon as eye contact can be made. After the spell effects begin, eye contact does not need to be maintained. You initially learn the surface thoughts of the being - what is most on its mind in that moment. As an action, you can attempt to probe deeper into its mind. If you probe deeper, the target must make a Wisdom saving throw. If it fails, you gain insight into its reasoning (if any), its emotional state, and something that looms large in its mind (such as something it worries over, loves, or hates). If it succeeds, the spell ends. You can probe deeper a second time, forcefully pulling memories from the being's mind if it fails the second Wisdom saving throw. Questions verbally directed at the target naturally shape the course of its thoughts, so this spell is particularly effective as part of an interrogation. If you cast the spell verbally and the target can hear you, it knows you are probing into its mind and the creature can use its action on its turn to make an Intelligence check contested by your Intelligence check. If it succeeds, the spell ends. At Higher Levels. When you cast this spell using a spell slot of 4th level or higher, the DC of the Wisdom saving throws increases by 1 for each slot level above 3rd.",
    "subclassRestricted": true
  },
  {
    "name": "Levicorpus/Liberacorpus",
    "english_title": "The Dangling Jinx",
    "level": 4,
    "school": "Curse",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "30 feet",
    "duration": "1 minute",
    "tags": [],
    "description": "One of the few spells that are a non-verbal spell by design, this jinx yanks a being's feet out from under it and dangles it in the air, hanging by its ankle. This spell always is cast with the effects of the Subtle Spell metamagic, at no sorcery point cost and whether you have Subtle Spell or not. A creature you can see within range must make a Wisdom saving throw or take 3d10 psychic damage and be restrained. Additionally, if the target tries to cast a spell, it must first succeed on a Wisdom saving throw, or the casting fails and the spell is wasted.",
    "subclassRestricted": false
  },
  {
    "name": "Locomotor",
    "english_title": "The Locomotion Charm",
    "level": 1,
    "school": "Charm",
    "ritual": true,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "30 feet",
    "duration": "1 hour",
    "tags": [],
    "description": "One object that isn't being worn or carried of your choice that you can see within range rises 3 feet off the ground, and remains suspended there for the duration. The spell can levitate a target that weighs up to 500 pounds. If more weight than the limit is placed on top of the object, the spell ends, and it falls to the ground. The object is immobile while you are within 20 feet of it. If you move more than 20 feet away from it, the object follows you so that it remains within 20 feet of you. It can move across uneven terrain, up or down stairs, slopes and the like, but it can't cross an elevation change of 10 feet or more. For example, the object can't move across a 10-foot-deep pit, nor could it leave such a pit if it was created at the bottom. If you move more than 100 feet from the object (typically because it can't move around an obstacle to follow you), the spell ends.",
    "subclassRestricted": false
  },
  {
    "name": "Locomotor Mortis",
    "english_title": "The Leg-Locker Curse",
    "level": 1,
    "school": "Curse",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "90 feet",
    "duration": "1 minute",
    "tags": [],
    "description": "A common tool among bullies, this \"curse\" binds a creature's legs as if they were tied together with rope. A creature you can see within range must succeed on a Wisdom saving throw or have its speed halved and suffer disadvantage on Dexterity saving throws. Additionally, each time it moves within the duration, it must succeed on a Dexterity saving throw without disadvantage from this spell, or be knocked prone and take 2d4 bludgeoning damage.",
    "subclassRestricted": false
  },
  {
    "name": "Lumos/Nox",
    "english_title": "The Wand-Lighting Charm",
    "level": 0,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "Self",
    "duration": "Until dispelled",
    "tags": [],
    "description": "Upon muttering the incantation, the tip of your wand sheds bright light in a narrow 15-foot cone and dim light for an additional 15 feet, much like a flashlight. The light is a bright white with a slight bluish tint. Completely covering the tip of your wand with something opaque blocks the light. The spell ends if you dismiss it with the nox incantation, as a bonus action.",
    "subclassRestricted": false
  },
  {
    "name": "Lumos Maxima",
    "english_title": "The Daylight Charm",
    "level": 3,
    "school": "Charm",
    "ritual": true,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "90 feet",
    "duration": "1 hour",
    "tags": [],
    "description": "A 60-foot-radius sphere of light spreads out from a small floating ball of light that hovers in place. The sphere is bright light and sheds dim light for an additional 60 feet. As a bonus action, you can direct the ball of light to a new position within range.",
    "subclassRestricted": false
  },
  {
    "name": "Melofors",
    "english_title": "The Pumpkin-Conjuring Spell",
    "level": 3,
    "school": "Transfiguration",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "60 feet",
    "duration": "1 minute",
    "tags": [],
    "description": "You conjure a pumpkin around a target's head, blinding and deafening it. Choose one creature that you can see within range to make a Wisdom saving throw. If it fails, the target is blinded and deafened for the duration. At the end of each of its turns, the target can make a Wisdom saving throw. On a success, the spell's effect ends for that target. At Higher Levels. When you cast this spell using a spell slot of 4th level or higher, you can target one additional creature for each slot level above 3rd.",
    "subclassRestricted": false
  },
  {
    "name": "Mimblewimble",
    "english_title": "The Tongue-Tying Curse",
    "level": 1,
    "school": "Curse",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "90 feet",
    "duration": "1 round",
    "tags": [],
    "description": "If you're hit with this spell, this produces the strange sensation of your tongue being rolled up into the back of your mouth. Choose one being you can see within range. If it tries to cast a spell verbally before the end of its next turn, it must first succeed on a Dexterity saving throw, or the casting fails and the spell is wasted.",
    "subclassRestricted": false
  },
  {
    "name": "Mobilicorpus",
    "english_title": "The Carrying Charm",
    "level": 1,
    "school": "Charm",
    "ritual": true,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "30 feet",
    "duration": "1 hour",
    "tags": [],
    "description": "One willing, paralyzed, petrified, restrained, stunned or unconscious being of your choice that you can see within range rises 3 feet off the ground, and remains suspended there for the duration as if it were hoisted by invisible ropes under its arms. The spell can levitate a target that weighs up to 500 pounds. If more weight than the limit is placed on top of the being, the spell ends, and it falls to the ground. The being is immobile while you are within 20 feet of it. If you move more than 20 feet away from it, the being follows you so that it remains within 20 feet of you. It can move across uneven terrain, up or down stairs, slopes and the like, but it can't cross an elevation change of 10 feet or more. For example, the being can't move across a 10-foot-deep pit, nor could it leave such a pit if it was created at the bottom. If you move more than 100 feet from the being (typically because it can't move around an obstacle to follow you), the spell ends.",
    "subclassRestricted": false
  },
  {
    "name": "Molliare",
    "english_title": "The Cushioning Charm",
    "level": 0,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "Touch",
    "duration": "1 hour",
    "tags": [],
    "description": "This comfortable charm is most commonly found on a broomstick. One object you touch with your wand is wrapped in an invisible cushioning effect for the duration, almost like two magnets repelling one another.",
    "subclassRestricted": false
  },
  {
    "name": "Muffliato",
    "english_title": "The Anti-Eavesdropping Charm",
    "level": 2,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "Self",
    "duration": "Concentration, up to 1 hour",
    "tags": ["School of Magic - Charms"],
    "description": "For the duration, each creature you choose within 30 feet of you (including you) are able to converse with each other without anyone or anything else hearing. Instead of the voices, nearby creatures hear a faint buzzing, like white noise. If a creature is within 15 feet of you and sees your mouth move when you speak, it is aware that your voice is being magically masked.",
    "subclassRestricted": true
  },
  {
    "name": "Ne Ustio",
    "english_title": "The Flame-Freezing Charm",
    "level": 5,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "Touch",
    "duration": "Concentration, up to 1 hour",
    "tags": ["Defensive"],
    "description": "For the duration, the creature you touch or yourself has immunity to fire damage, excluding dragon fire and the azreth spell (Fiendfyre). At Higher Levels. When you cast this spell using a spell slot of 6th level or higher, the duration is doubled for each slot level above 5th. When you use a spell slot of 8th level or higher, concentration is no longer required and its effect applies to dragon fire.",
    "subclassRestricted": false
  },
  {
    "name": "Nebulus",
    "english_title": "The Fog Spell",
    "level": 1,
    "school": "Transfiguration",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "120 feet",
    "duration": "Concentration, up to 1 hour",
    "tags": [],
    "description": "You create a 20-foot-radius sphere of fog centered on a point within range. The sphere spreads around corners, and its area is heavily obscured. It lasts for the duration or until a wind of moderate or greater speed (at least 10 miles per hour) disperses it. At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the radius of the fog increases by 20 feet for each slot level above 1st.",
    "subclassRestricted": false
  },
  {
    "name": "Novum Spirare",
    "english_title": "The Bubble-Head Charm",
    "level": 3,
    "school": "Charm",
    "ritual": true,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "Touch",
    "duration": "24 hours",
    "tags": [],
    "description": "Accurately named, the bubble-head charm forms a large bubble-like mask over a creature's mouth, nose, and ears that is magically filled with never-ending fresh air. This spell grants one willing creature you can see within range the ability to breathe underwater or in a vacuum until the spell ends. Additionally, the creature is immune to poison damage due to inhalation for the duration. The creature can dispel this effect using an action.",
    "subclassRestricted": false
  },
  {
    "name": "Nullum Effugium",
    "english_title": "The Anti-Disapparition Jinx",
    "level": 5,
    "school": "Curse",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "10 minutes",
    "range": "Self (60-foot-radius sphere)",
    "duration": "8 hours",
    "tags": ["Defensive", "School of Magic - Jinxes", "Hexes", "and Curses"],
    "description": "Commonly used by the Department of Magical Law enforcement, this wards an area against apparition or disapparition. No one may arrive in the warded area via apparition, nor may any creatures within the warded area cast the spell. Any attempt to do so results in the typical apparition effect, except the creature stays exactly where they are. At Higher Levels. When you cast this spell using a spell slot of 6th level or higher, the radius of the sphere increases by 60 feet for each slot level above 5th.",
    "subclassRestricted": true
  },
  {
    "name": "Obscuro",
    "english_title": "The Blindfold Spell",
    "level": 1,
    "school": "Transfiguration",
    "ritual": true,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "60 feet",
    "duration": "Until dispelled",
    "tags": [],
    "description": "You can conjure a black blindfold that magically wraps itself around a foe's head. Choose one creature that you can see within range to make a Dexterity saving throw. If it fails, the target is blinded for the duration. The creature can remove the blindfold as an action.",
    "subclassRestricted": false
  },
  {
    "name": "Omnifracto",
    "english_title": "The Shield Penetrating Spell",
    "level": 5,
    "school": "Curse",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "90 feet",
    "duration": "Instantaneous",
    "tags": ["School of Magic - Jinxes", "Hexes", "and Curses"],
    "description": "A piercing beam of light shoots out from the tip of your wand, shattering any defensive magic it passes through. Choose a target within range. Protego totalum, repello inimicum, and all defensive spells that are improving that creature’s AC or granting it temporary hit points are dispelled.",
    "subclassRestricted": true
  },
  {
    "name": "Oppugno",
    "english_title": "The Swarming Jinx",
    "level": 2,
    "school": "Curse",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "30 feet",
    "duration": "Concentration, up to 1 minute",
    "tags": [],
    "description": "You cast this jinx on a group of tiny objects or a group of birds within range. The targets start swarming in the air in a 5-foot- diameter sphere in an unoccupied space of your choice. Any creature that starts its turn within 5 feet of the swarm or enters the swarm’s area for the first time on a turn must make a Dexterity saving throw. The creature takes 4d4 slashing damage on a failed save, or half as much damage on a successful one. As a bonus action, you can move the sphere up to 30 feet. While the swarm shares the same space with a creature, that creature has disadvantage on attack rolls. The swarm's space counts as difficult terrain. At Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d4 for each slot level above 2nd.",
    "subclassRestricted": false
  },
  {
    "name": "Orbis",
    "english_title": "The Rooting Spell",
    "level": 2,
    "school": "Transfiguration",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "60 feet",
    "duration": "Concentration, up to 1 minute",
    "tags": ["School of Magic - Transfiguration"],
    "description": "You choose a space on the ground that is currently occupied by a Large or smaller creature you can see within range. The ground becomes a thick liquid and swirls out from under the creature in an orb-like shape. The material then slams back down and regains its solidity in an attempt to partially bury the creature. The target must make a Dexterity saving throw. On a failed save, the target takes 3d6 bludgeoning damage and is restrained for the spell’s duration. As an action, you can cause the earth to crush the restrained target, who must make a Strength saving throw. It takes 3d6 bludgeoning damage on a failed save, or half as much damage on a successful one. To break out, the restrained target can use its action to make a Strength check against your spell save DC. On a success, the target pulls its legs free and is no longer restrained. At Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d6 for each slot level above 2nd.",
    "subclassRestricted": true
  },
  {
    "name": "Orchideous",
    "english_title": "The Flower-Conjuring Spell",
    "level": 0,
    "school": "Transfiguration",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "10 feet",
    "duration": "Instantaneous",
    "tags": [],
    "description": "You conjure a blooming flower, bouquet, or wreath in the desired location within range.",
    "subclassRestricted": false
  },
  {
    "name": "Partis Temporus",
    "english_title": "The Barrier-Opening Charm",
    "level": 2,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "90 feet",
    "duration": "Instantaneous",
    "tags": ["Defensive"],
    "description": "This unique charm redirects magical effects to create an opening. On any area spell of 3rd level or lower that forms a line, wall, or perimeter, an opening appears in the spell's effect at a point of your choice that you can see within range and lasts for the duration. You choose the opening’s dimensions: up to 5 feet wide and 8 feet tall. For a spell of 4th level or higher on the target, make an ability check using your spellcasting ability. The DC equals 10 + the spell’s level. On a successful check, the opening is created. The opening can be dispelled at will. At Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, you automatically create an opening in the spell if the spell's level is one level higher than, equal to or less than the level of the spell slot you used.",
    "subclassRestricted": false
  },
  {
    "name": "Pereo",
    "english_title": "The Extinguishing Charm",
    "level": 0,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "30 feet",
    "duration": "Instantaneous",
    "tags": [],
    "description": "You choose a flame that you can see within range and that fits within a 5-foot cube. You instantaneously extinguish the flames within the cube.",
    "subclassRestricted": false
  },
  {
    "name": "Perfusorius",
    "english_title": "The Feather-Light Charm",
    "level": 1,
    "school": "Charm",
    "ritual": true,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "Touch",
    "duration": "1 hour",
    "tags": [],
    "description": "This spell alters an object of up to 500 pounds, changing its weight to be just barely heavier than the atmosphere around it. The slightest force is needed to move, pick up, or carry this object for the duration. It can be easily thrown as well.",
    "subclassRestricted": false
  },
  {
    "name": "Periculum/Verdimillious",
    "english_title": "The Flare Charm",
    "level": 0,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "Self",
    "duration": "Instantaneous",
    "tags": [],
    "description": "This spell sends red (periculum) or green (verdimillious) sparks shooting from the casters wand for signaling purposes. It may also appear as a flare, traveling a desired distance before exploding in light and hovering in the air.",
    "subclassRestricted": false
  },
  {
    "name": "Petrificus Totalus",
    "english_title": "The Full Body-Bind Curse",
    "level": 1,
    "school": "Curse",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "60 feet",
    "duration": "Dedication, up to 1 minute",
    "tags": [],
    "description": "This spell makes a being's arms and legs snap together, and it will fall down, stiff as a board. Make a ranged spell attack against a being within range. On a hit, the target is knocked prone and paralyzed for the duration. At Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, you can target a beast instead of a being.",
    "subclassRestricted": false
  },
  {
    "name": "Piertotum Locomotor",
    "english_title": "The Animating Charm",
    "level": 5,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "90 feet",
    "duration": "Concentration, up to 1 minute",
    "tags": ["School of Magic - Charms"],
    "description": "Objects come to life at your command. Choose up to five nonmagical objects within range that are not being worn or carried. Medium targets count as one object, Large targets count as two objects, Huge targets count as four objects. You can't animate any object larger than Huge. Each target animates and becomes a creature under your control until the spell ends or until reduced to 0 hit points. As a bonus action, you can mentally command any creature you made with this spell if the creature is within 500 feet of you (if you control multiple creatures, you can command any or all of them at the same time, issuing the same command to each one). You decide what action the creature will take and where it will move during its next turn, or you can issue a general command, such as to guard a particular chamber or corridor. If you issue no commands, the creature only defends itself against hostile creatures. Once given an order, the creature continues to follow it until its task is complete. Animated Object Statistics Size HP AC Attack Str Dex Medium 40 13 +5 to hit, 2d6 + 1 damage 10 12 Large 50 10 +6 to hit, 2d10 + 2 damage 14 10 Huge 80 10 +8 to hit, 2d12 + 4 damage 18 6 An animated object is a construct with AC, hit points, attacks, Strength, and Dexterity determine by its size. Its Constitution is 10 and its Intelligence and Wisdom are 3, and its Charisma is 1. Its speed is 30 feet, if the Objects lack legs or other appendages it can use for locomotion, it instead has a flying speed of 30 feet and can hover. If the object is securely attached to a surface or larger object, such as a chain bolted to a wall, its speed is 0. It has blindsight with a radius of 30 feet and is blind beyond that distance. When the animated object drops to 0 hit points, it is destroyed. If you command an object to attack, it can make a single melee attack against a creature within 5 feet of it. It makes a slam attack with an attack bonus and bludgeoning damage determine by its size. The HM might rule that a specific object inflicts slashing or piercing damage based on its form. At Higher Levels. If you cast this spell using a spell slot of 6th level or higher, you can animate one additional object for each slot level above 5th.",
    "subclassRestricted": true
  },
  {
    "name": "Prior Incantato",
    "english_title": "The Reverse Spell",
    "level": 0,
    "school": "Divination",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "Self",
    "duration": "Instantaneous",
    "tags": [],
    "description": "Often used as an investigative tool in wizarding crimes, this spell produces a ghostly recreation of the previous spell cast by the currently used wand. If the previously cast spell cannot be represented visually, you learn the incantation that was used, regardless of whether the incantation was spoken aloud at the time of casting. This spell can be cast a total of three consecutive times on a single wand, revealing the three most recently cast spells.",
    "subclassRestricted": false
  },
  {
    "name": "Protego",
    "english_title": "The Shield Charm",
    "level": 1,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action or reaction, which you take when you are hit by an attack",
    "range": "Self",
    "duration": "Dedication, up to 10 minutes",
    "tags": ["Defensive"],
    "description": "An invisible barrier of magical force appears in front of you and protects you. For the duration, you have a +5 bonus to AC, including against the triggering attack. If you are targeted by a spell that requires an attack roll and the spell's level is equal to or lower than half your proficiency bonus, the spell has no effect on you. You can use a bonus action to change which direction the shield is facing. If you are attacked from either of your sides or from behind while casting this spell, you must use your reaction to redirect the shield to point towards the threat. Otherwise, this spell doesn't protect you.",
    "subclassRestricted": false
  },
  {
    "name": "Protego Maxima",
    "english_title": "The Orb Shield Charm",
    "level": 2,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action or reaction, which you take when you are hit by an attack",
    "range": "Self",
    "duration": "Dedication, up to 10 minutes",
    "tags": ["Defensive"],
    "description": "You cast a fully encompassing protego around yourself, sacrificing durability for coverage. For the duration, you have a +3 bonus to AC, including against the triggering attack. If you are subjected to an effect that allows you to make a Strength or Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw and only half damage if you fail.",
    "subclassRestricted": false
  },
  {
    "name": "Protego Totalum",
    "english_title": "The Area Shield Charm",
    "level": 6,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "Self (10-foot-radius sphere)",
    "duration": "Concentration, up to 1 minute",
    "tags": ["Defensive", "School of Magic - Healing"],
    "description": "An immobile, faintly shimmering barrier springs into existence in a 10-foot radius around you and remains for the duration. Any attack or spell of 5th level or lower cast from outside the barrier can’t affect creatures or objects within it, even if the spell is cast using a higher level spell slot. Such a spell can target creatures and objects within the barrier, but the spell has no effect on them. Similarly, the area within the barrier is excluded from the areas affected by such spells. At Higher Levels. When you cast this spell using a spell slot of 7th level or higher, the barrier blocks spells of one level higher for each slot level above 6th.",
    "subclassRestricted": true
  },
  {
    "name": "Reducio",
    "english_title": "The Shrinking Charm",
    "level": 1,
    "school": "Charm",
    "ritual": true,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "30 feet",
    "duration": "1 hour",
    "tags": [],
    "description": "You cause an object that isn't being worn or carried and that you can see within range to shrink in size for the duration. The target’s size is halved in all dimensions, and its weight is reduced to one-eighth of normal. This reduction decreases its size by one category – from Medium to Small, for example.",
    "subclassRestricted": false
  },
  {
    "name": "Reducto",
    "english_title": "The Reductor Curse",
    "level": 4,
    "school": "Curse",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "90 feet",
    "duration": "Instantaneous",
    "tags": [],
    "description": "This spell disintegrates a Large or smaller nonmagical object or transfigured/conjured construct you can see within range. If the target is a Huge or larger object or construct, this spell disintegrates a 10-foot-cube portion of it.",
    "subclassRestricted": false
  },
  {
    "name": "Rennervate",
    "english_title": "The Reviving Spell",
    "level": 0,
    "school": "Healing",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "10 feet",
    "duration": "Instantaneous",
    "tags": [],
    "description": "The counterspell to stupefy, this incantation is invaluable in extended combat or team dueling. Magically induced unconsciousness is ended for a being of your choice you can see within range.",
    "subclassRestricted": false
  },
  {
    "name": "Reparifarge",
    "english_title": "The Untransfiguration Incantation",
    "level": 2,
    "school": "Transfiguration",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "90 feet",
    "duration": "Instantaneous",
    "tags": ["Defensive", "School of Magic - Transfiguration"],
    "description": "Choose any creature, object, or magical effect within range. One Transfiguration spell of 2nd level or lower on the target ends. If you are aware of at least one spell affecting the target, you can specify that spell in your mind. If you are unaware of what spells are affecting the target, one randomly selected spell ends. For a spell of a higher level on the target, make an ability check using your spellcasting ability. The DC equals 10 + the spell's level. On a successful check, the spell ends. At Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, you automatically end the effects of a Transfiguration spell on the target if the spell's level is equal to or less than the level of the spell slot you used.",
    "subclassRestricted": true
  },
  {
    "name": "Reparifors",
    "english_title": "The Curing Spell",
    "level": 1,
    "school": "Healing",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "Touch",
    "duration": "Instantaneous",
    "tags": [],
    "description": "With a tap of your wand, a being that you can see within range regains 1d8 hit points. You can also end either one disease or one condition afflicting it. The condition can be blinded, deafened, paralyzed, or poisoned. At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the healing increases by 1d8 for each slot level above 1st.",
    "subclassRestricted": false
  },
  {
    "name": "Reparo",
    "english_title": "The Mending Charm",
    "level": 2,
    "school": "Charm",
    "ritual": true,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "30 feet",
    "duration": "Instantaneous",
    "tags": [],
    "description": "This spell magically reverses any damage done to any objects or structures within a 5-foot cube, collecting all the pieces or components and reassembling them. Anything previously contained by the broken target, like a spilled liquid, is not placed back inside it. Anything affected by the breaking of the target, like a person who fell through a broken platform, is not undone. There is no effect on anything within the area that's undamaged, nor on anything damaged by time or decay. This spell can physically repair a magic item, but the spell can’t restore magic to such an object. At Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, the cube's size increases by 10 feet for each slot level above 2nd.",
    "subclassRestricted": false
  },
  {
    "name": "Repello Inimicum",
    "english_title": "The Evil Protection Charm",
    "level": 3,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 minute",
    "range": "Self (20-foot-radius hemisphere)",
    "duration": "1 hour",
    "tags": ["Defensive"],
    "description": "You create a 20-foot-radius hemisphere of magical energy to protect you from one or more of the following: Dark wizards, other Dark beings, or Dark beasts. The circle affects creatures of the chosen type(s) in the following ways. The affected creatures can't willingly enter the hemisphere by nonmagical means. If the creature tries to use apparition to do so, it must first succeed on a Charisma saving throw. The affected creatures have disadvantage on attack rolls against targets within the hemisphere. Targets within the hemisphere can't be charmed or frightened by affected creatures. At Higher Levels. When you cast this spell using a spell slot of 4th level or higher, the duration increases by 1 hour for each slot level above 3rd.",
    "subclassRestricted": false
  },
  {
    "name": "Revelio",
    "english_title": "The Revealing Charm",
    "level": 3,
    "school": "Divination",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "10 feet",
    "duration": "Instantaneous",
    "tags": [],
    "description": "With a twist of your wand, the true appearance of a creature or object is revealed. A disguised, hidden, invisible or otherwise magically concealed target is made visible, dispelling any spell producing such effects and magically removing physical alterations. Your wand must be pointing at the target for this spell to take effect.",
    "subclassRestricted": false
  },
  {
    "name": "Rictusempra",
    "english_title": "The Tickling Charm",
    "level": 1,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "60 feet",
    "duration": "1 round",
    "tags": [],
    "description": "This low-level dueling spell gives the recipient an intense tickling sensation. Make a ranged spell attack against a being within range. On a hit, the target will double over in laughter and become incapacitated with its speed halved until the start of your next turn.",
    "subclassRestricted": false
  },
  {
    "name": "Riddikulus",
    "english_title": "The Boggart-Banishing Spell",
    "level": 1,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "30 feet",
    "duration": "Instantaneous",
    "tags": [],
    "description": "This spell has a very specific application: forcing a boggart to transform into a comedic version of its current form. Only a boggart may be targeted by this spell.",
    "subclassRestricted": false
  },
  {
    "name": "Sagittario",
    "english_title": "The Arrow-Shooting Spell",
    "level": 1,
    "school": "Transfiguration",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "150 feet",
    "duration": "Instantaneous",
    "tags": ["Dark"],
    "description": "A conjured arrow streaks toward a designated target. Make a ranged spell attack against a target within range. On a hit, the target takes piercing damage equal to 1d8 + your spellcasting ability modifier. At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, you conjure one additional arrow for each slot level above 1st. You can direct the arrows at the same target or at different ones. Make a separate attack roll for each arrow.",
    "subclassRestricted": false
  },
  {
    "name": "Salvio Hexia",
    "english_title": "The Curse-Blocking Charm",
    "level": 5,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "Self (10-foot-radius sphere)",
    "duration": "Concentration, up to 1 minute",
    "tags": ["Defensive"],
    "description": "Each creature within the spell's area gains temporary hit points equal to your spellcasting modifier at the beginning of its turn and advantage on all saving throws against spells.",
    "subclassRestricted": false
  },
  {
    "name": "Scourgify",
    "english_title": "The Scouring Charm",
    "level": 0,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "10 feet",
    "duration": "Instantaneous",
    "tags": [],
    "description": "An object no larger than 5 cubic feet is flawlessly cleaned.",
    "subclassRestricted": false
  },
  {
    "name": "Sectumsempra",
    "english_title": "The Lacerating Curse",
    "level": 4,
    "school": "Curse",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "60 feet",
    "duration": "Instantaneous",
    "tags": ["Dark", "School of Magic - Jinxes, Hexes, and Curses"],
    "description": "Make a ranged spell attack against a target within range. On a hit, the target must make a Constitution saving throw. On a failed save, a creature takes 10d6 slashing damage and another 5d6 slashing damage at the end of its next turn. On a successful save, a creature takes half the initial damage and half the damage at the end of its next turn. At Higher Levels. When you cast this spell using a spell slot of 5th level or higher, the initial damage increases by 2d6 for each slot level above 4th.",
    "subclassRestricted": true
  },
  {
    "name": "Serpensortia",
    "english_title": "The Snake Summons Spell",
    "level": 2,
    "school": "Transfiguration",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "30 feet",
    "duration": "Instantaneous",
    "tags": ["Dark"],
    "description": "You conjure a venomous snake from thin air. A pit viper appears in an unoccupied space that you can see within range. Roll initiative for the summoned creature, which has its own turns. Although the pit viper won't willingly attack the caster, you cannot control the actions or targets of the pit viper. It is possible for the pit viper to be turned against you through magical means. At Higher Levels. When you cast this spell using a higher level spell slot, multiple pit vipers are conjured in unoccupied spaces that you can see within range. Choose from the following options: two pit vipers (4th level), three pit vipers (6th level), or four pit vipers (8th level). Initiative is rolled as a group.",
    "subclassRestricted": false
  },
  {
    "name": "Silencio",
    "english_title": "The Silencing Charm",
    "level": 2,
    "school": "Charm",
    "ritual": true,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "90 feet",
    "duration": "1 minute",
    "tags": [],
    "description": "This charm is extremely effective against wizards unpracticed in non-verbal magic. Choose one target that you can see within range. If it's a creature, it must make a Wisdom saving throw. If it fails or if it's an object, all sound created by the target is made completely silent. Casting a spell that includes a verbal component is impossible while under the effect of this spell.",
    "subclassRestricted": false
  },
  {
    "name": "Slugulus Eructo",
    "english_title": "The Slug-Vomiting Hex",
    "level": 2,
    "school": "Curse",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "60 feet",
    "duration": "1 round",
    "tags": [],
    "description": "This particularly nasty hex causes one to spit up slugs for the duration. Make a ranged spell attack against a creature within range. On a hit, it takes 3d8 psychic damage and gains one level of exhaustion. This spell cannot cause it to reach more than 5 levels of exhaustion. If it tries to cast a spell verbally before the end of its next turn, it must first succeed on a Constitution saving throw, or the casting fails and the spell is wasted. At Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d8 for each slot level above 2nd.",
    "subclassRestricted": false
  },
  {
    "name": "Sonorus/Quietus",
    "english_title": "The Amplifying Charm",
    "level": 0,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "Self",
    "duration": "Until dispelled",
    "tags": [],
    "description": "When you hold the tip of your wand to your neck and cast this spell, your voice booms up to three times as loud as normal. Your voice is loud enough to fill a large stadium, but won't cause any hearing damage. Casting quietus with your wand to your throat is the counter-charm and ends the effect.",
    "subclassRestricted": false
  },
  {
    "name": "Specialis Revelio",
    "english_title": "The Spell Revealing Spell",
    "level": 1,
    "school": "Divination",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "Touch",
    "duration": "Instantaneous",
    "tags": [],
    "description": "You tap your wand on an object or area, revealing magical influences. If it is a magic item or some other magic-imbued object, you learn its properties and how to use them, whether it requires attunement to use, and how many charges it has, if any. You learn whether any spells are affecting the item and what they are. If the item was created by a spell, you learn which spell created it. If cast on an area, you learn what spells, if any, are currently active within a 5-foot cube in front of you. The border of each spell's effect is illuminated within that cube, much like blowing dust through laser beams.",
    "subclassRestricted": false
  },
  {
    "name": "Spongify",
    "english_title": "The Softening Charm",
    "level": 0,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action or reaction, which you take when a collision occurs within 30 feet",
    "range": "30 feet",
    "duration": "1 minute",
    "tags": [],
    "description": "This spell makes an object you can see within range become soft and bouncy, like a sponge or mattress. Any damage from falling on or colliding with this object is nullified. This spell can be cast as a reaction to a collision affecting a creature or two objects you can see within range.",
    "subclassRestricted": false
  },
  {
    "name": "Stupefy",
    "english_title": "The Stunning Spell",
    "level": 2,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "60 feet",
    "duration": "10 minutes",
    "tags": [],
    "description": "This charm is the most common dueling spell in the wizarding world, harmlessly ending a duel between two wizards. Make a ranged spell attack against a being within range. On a hit, the target falls unconscious for the duration, or until they are revived with rennervate. At Higher Levels. If you cast this spell using a spell slot of 3rd level or higher, the duration increases to 1 hour (3rd level) or 8 hours (4th level). Alternatively, when you cast this spell using a spell slot of 4th level or higher, you can target a beast instead of a being, for a duration of 10 minutes (4th level), 1 hour (5th level) or 8 hours (6th level).",
    "subclassRestricted": false
  },
  {
    "name": "Tarantallegra",
    "english_title": "The Dancing Feet Jinx",
    "level": 2,
    "school": "Curse",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "60 feet",
    "duration": "Concentration, up to 1 minute",
    "tags": [],
    "description": "This entertaining jinx forces its victim to do a comic dance in place: shuffling, tapping its feet, and capering. Make a ranged spell attack against a target within range. On a hit, a dancing creature must use all its movement to dance without leaving its space until the end of your next turn. While the creature is affected by this spell, it has disadvantage on Dexterity saving throws and attack rolls and other creatures have advantage on attack rolls against it. As an action, a dancing creature can make a Wisdom saving throw to regain control of itself. On a successful save, the spell ends.",
    "subclassRestricted": false
  },
  {
    "name": "Tergeo",
    "english_title": "The Siphoning Charm",
    "level": 0,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "Touch",
    "duration": "Concentration, up to 1 minute",
    "tags": [],
    "description": "You choose an specific liquid that you can see within range and that fits within a 5-foot cube. The liquid gathers up into a blob floating at the tip of your wand, and you can direct it to form into simple shapes, animate, or flow into a container.",
    "subclassRestricted": false
  },
  {
    "name": "Ventus",
    "english_title": "The Cyclone Jinx",
    "level": 2,
    "school": "Curse",
    "ritual": true,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "60 feet",
    "duration": "Concentration, up to 1 minute",
    "tags": [],
    "description": "A strong gust of air flows out from the tip of your wand, and creates one of the following effects at a point you can see within range: One Medium or smaller creature that you choose must succeed on a Strength saving throw or be instantaneously pushed up to 5 feet away from you and be rendered unable to move closer to you for the duration. You create a small blast of air capable of moving one object that is neither held nor carried and that weighs no more than 5 pounds. The object is pushed up to 10 feet away from you per round, for the duration of the spell. It isn’t pushed with enough force to cause damage. You create a harmless sensory effect using air, such as causing leaves to rustle, wind to slam shutters shut, or your clothing to ripple in a breeze. If desired, the air can be hot and function like a blow dryer. At Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd. The creatures must be within 30 feet of each other when you target them.",
    "subclassRestricted": false
  },
  {
    "name": "Vera Verto",
    "english_title": "The General Transfiguration Incantation",
    "level": 0,
    "school": "Transfiguration",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "Touch",
    "duration": "Until dispelled",
    "tags": [],
    "description": "This universal incantation is taught to Hogwarts students in their first Transfiguration class. You transfigure one nonmagical object that you can see within range and that fits within a 1-foot cube into another nonmagical object of similar size and mass and of equal or lesser value. At Higher Levels. When you cast this spell using a spell slot of 1st level or higher, you may select or stack one of the following effects for each slot level above 0. Increase the cube size by 2 feet. Target a living Beast (if unwilling, it must succeed on a Wisdom saving throw to avoid the effect). Transfigure into a construct (Duration: Concentration, up to 1 minute).",
    "subclassRestricted": false
  },
  {
    "name": "Vigilatus",
    "english_title": "The Intruder Charm",
    "level": 1,
    "school": "Charm",
    "ritual": true,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 minute",
    "range": "30 feet",
    "duration": "8 hours",
    "tags": ["Defensive"],
    "description": "You set a mental alarm against unwanted intrusion. Choose a door, a window, or an area within range that is no larger than a 20-foot cube. Until the spell ends, a ping in your mind alerts you whenever a Tiny or larger creature touches or enters the warded area, if you are within 1 mile of the warded area. This ping awakens you if you are sleeping. When you cast the spell, you can designate creatures that won't set off the alarm.",
    "subclassRestricted": false
  },
  {
    "name": "Vulnera Sanentur",
    "english_title": "The Regenerating Spell",
    "level": 6,
    "school": "Healing",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "Touch",
    "duration": "Concentration, up to 1 minute",
    "tags": ["School of Magic - Healing"],
    "description": "Tracing your wand over a being's wounds, you weave a complex counter-curse that undoes the damage dealt to a being. The target regains four times your spellcasting ability modifier + 4d8 hit points instantaneously, and then 4d4 hit points for every following turn for the duration of the spell. If the target has lost body members (fingers, legs, and so on) and the severed part is held to its place throughout the entire duration of the spell, the spell causes the limb to heal back on after 1 minute of casting. At Higher Levels. When you cast this spell using a spell slot of 7th level or higher, the instantaneous healing increases by 1d8 and the subsequent healing increases by 3d4 for each slot level above 6th.",
    "subclassRestricted": true
  },
  {
    "name": "Arresto Momentum",
    "english_title": "The Slowing Charm",
    "level": 1,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 reaction, which you take when you or a creature within 60 feet of you falls",
    "range": "60 feet",
    "duration": "1 minute",
    "tags": [],
    "description": "Choose up to five falling creatures within range. A falling creature's rate of descent slows to 60 feet per round until the spell ends. If the creature lands before the spell ends, it takes no falling damage and can land on its feet, and the spell ends for that creature.",
    "subclassRestricted": false
  },
  {
    "name": "Cantis",
    "english_title": "The Singing Jinx",
    "level": 0,
    "school": "Curse",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "60 feet",
    "duration": "1 round",
    "tags": [],
    "description": "When struck by this spell, a being can't help but belt out a couple of lines from the first song that comes to mind. Make a ranged spell attack against a being within range. On a hit, the target must cast all other spells non-verbally until the end of its next turn. If it tries to cast a spell verbally, it must first succeed on an Intelligence saving throw, or the casting fails and the spell is wasted.",
    "subclassRestricted": false
  },
  {
    "name": "Colovaria",
    "english_title": "The Color Change Charm",
    "level": 0,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "30 feet",
    "duration": "1 hour",
    "tags": [],
    "description": "You change the color of any target within range that lasts for the duration, to any desired complexity. The color may only be reverted by dispelling the charm. Physical interaction with the object reveals that the object has retained its original texture and material, but its color has truly changed.",
    "subclassRestricted": false
  },
  {
    "name": "Crucio",
    "english_title": "The Cruciatus Curse",
    "level": 7,
    "school": "Curse",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "30 feet",
    "duration": "Dedication, up to 1 minute",
    "tags": ["Dark - Unforgivable Curse"],
    "description": "With a single word and a heart full of hatred, waves of intense pain assail one creature you can see within range. If the target has 100 hit points or fewer, it is subject to crippling pain. Otherwise, the spell has no effect on it. While the target is affected by crippling pain, any speed it has can be no higher than 10 feet. The target also has disadvantage on attack rolls, ability checks, and saving throws, other than Constitution saving throws. Finally, if the target tries to cast a spell, it must first succeed on a Constitution saving throw, or the casting fails and the spell is wasted. A target suffering this pain must make a Constitution saving throw at the end of each of its turns. On a failed save, the target gains one level of exhaustion.",
    "subclassRestricted": false
  },
  {
    "name": "Diffindo",
    "english_title": "The Severing Charm",
    "level": 1,
    "school": "Charm",
    "ritual": true,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "30 feet",
    "duration": "Instantaneous",
    "tags": [],
    "description": "An object is precisely torn or cut, as if a magical blade extended from the tip of your wand. This spell was not designed to be used on creatures and only makes very shallow cuts. Choose a target you can see within range that fits within a 5-foot cube. If the target is a creature, it must make a Dexterity saving throw. It takes 4d4 slashing damage on a failed save or half as much damage on a successful one. This is the counterspell to incarcerous, immediately ending that spell's effects. At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, you can target one additional creature or the cube's size increases by 5 feet for each slot level above 1st. If targeting additional creatures, the targets must be within 10 feet of each other when you target them.",
    "subclassRestricted": false
  },
  {
    "name": "Ebublio",
    "english_title": "The Bubble Spell",
    "level": 4,
    "school": "Transfiguration",
    "ritual": true,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "90 feet",
    "duration": "Concentration, up to 1 minute",
    "tags": [],
    "description": "You conjure up a swirling sphere of water with a 5-foot radius at a point you can see within range. The sphere can hover but no more than 10 feet off the ground. The sphere remains for the spell’s duration. Any creature in the sphere’s space must make a Strength saving throw. On a successful save, a creature is ejected from that space to the nearest unoccupied space of the creature’s choice outside the sphere. A Huge or larger creature succeeds on the saving throw automatically, and a Large or smaller creature can choose to fail it. On a failed save, a creature is restrained by the sphere and is engulfed by the swirling bubble of water. At the end of each of its turns, a restrained target can repeat the saving throw, ending the effect on itself on a success. The sphere can restrain as many as four Medium or smaller creatures or one Large creature. If the sphere restrains a creature that causes it to exceed this capacity, a random creature that was already restrained by the sphere falls out of it and lands prone in a space within 5 feet of it. As an action, you can move the sphere up to 30 feet in a straight line. If it moves over a pit, a cliff, or other drop-off, it safely descends until it is hovering 10 feet above the ground. Any creature restrained by the sphere moves with it. You can ram the sphere into creatures, forcing them to make the saving throw. When the spell ends, the sphere falls to the ground and extinguishes all normal flames within 30 feet of it. Any creature restrained by the sphere is knocked prone in the space where it falls. The water then vanishes.",
    "subclassRestricted": false
  },
  {
    "name": "Expecto Patronum",
    "english_title": "The Patronus Charm",
    "level": 3,
    "school": "Charm",
    "ritual": true,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "10 feet",
    "duration": "Concentration, up to 1 minute",
    "tags": ["Defensive"],
    "description": "A Patronus Charm is a special bit of magic that requires a wizard to envision one of their happiest memories while casting the spell. The feeling of happiness must be genuine or strong enough to produce a radiant, ethereal beast, the embodiment of that wizard's positive emotions that serves as their protector. When you cast this spell, you can choose to conjure an incorporeal or corporeal patronus. If you attempt to cast this spell while frightened or within 60 feet of a dementor, you must make an ability check using your spellcasting ability. The DC equals 10 + the number of dementors within 60 feet of you. A roll of 19-20 on the die automatically succeeds. On a success, you cast the spell. On a failure, you can only conjure an incorporeal patronus, but if you fail the check by 5 or more, the spell fails entirely. At the end of your turn, if you are frightened or there are one or more dementors within 60 feet of you while concentrating on this spell, you must repeat the ability check. On a failure, your patronus vanishes and the spell ends. Highly Advanced Magic The Patronus Charm is regarded as a difficult spell partly because the caster must relive a truly joyful memory when casting. This spell's ability check is unusual, but represents the challenge of focusing on suitable memory in a stressful situation. Remember that a frightened creature has disadvantage on ability checks, including this one. Your HM can allow you to spend Inspiration to automatically succeed on this check. Your character might bring forth a powerful childhood memory in their time of need. A patronus sheds light in a radius around it. You and friendly creatures can't be frightened while in your patronus's light. A dementor that starts its turn within this light or enters the light for the first time on a turn must succeed on a Wisdom saving throw or become frightened of the patronus until the start of its next turn (this fear ignores any immunity to the frightened condition). While frightened, the dementor must take the Dash action on its turn and move away from the patronus by the safest available route until it leaves the light. Incorporeal Patronus. Your patronus takes the form of a 5-foot burst of glowing mist in an unoccupied space adjacent to you. The patronus doesn't fill its space. It sheds bright light in its space and dim light in a 5-foot radius. On subsequent turns, you can move the patronus to another space adjacent to you as a bonus action. Additionally, you can move it as a reaction to a dementor moving within 10 feet of you. Corporeal Patronus. Your patronus takes the form of a wispy silver animal in an unoccupied space that you can see within range. The patronus doesn't fill its space. It has no hit points and is immune to all damage, but can be targeted by another spell that affects magic, such as finite incantatem. The patronus sheds bright light in a 10-foot radius and dim light for an additional 10 feet. More than Dementors The Patronus Charm is most famous against dementors, but it can be a potent protector against other dark creatures in the Wizarding World. Only dementors and lethifolds have been confirmed to be affected by a patronus. At the HM's discretion, your patronus can interact with or harm creatures like banshees, inferi, or obscuri. If your HM decides a creature can be affected by a patronus, the creature is susceptible to the patronus's fear effect, attacks and damage. Even if a patronus is unable to harm a particular kind of creature, its soothing presence can still protect you by preventing fear. When you cast the spell and as a bonus action on subsequent turns, you can move the patronus. The distance you can move it depends on the size of the patronus. A Medium or smaller patronus can move 60 feet, a Large patronus can move 45 feet, and a Huge patronus can move 30 feet. A patronus ignores objects and terrain. In addition, the Patronus can enter a creature's space and stop there. At any time during the patronus's movement, you can direct the patronus to charge into a dementor within 5 feet of it. Make a melee spell attack for the patronus using your spell attack modifier. On a hit, the target takes 5d10 radiant damage and the patronus pushes the target up to 5 feet plus a number of feet equal to five times your spellcasting ability modifier. The patronus moves with the target to remain within 5 feet of it and does not use any movement to do so. At Higher Levels. When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d10 and the radius of the dim light increases by 5 feet for each slot level above 3rd.",
    "subclassRestricted": false
  },
  {
    "name": "Expulso",
    "english_title": "The Concussive Curse",
    "level": 3,
    "school": "Curse",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "90 feet",
    "duration": "Instantaneous",
    "tags": [],
    "description": "The spell shoots out from your wand and a wave of thunderous force sweeps out from a point of your choice within range. Each creature in a 10-foot-radius sphere centered on that point must make a Constitution saving throw. On a failed save, a creature takes 4d8 thunder damage and is pushed 10 feet away from that point. On a successful save, the creature takes half as much damage and isn’t pushed. In addition, unsecured objects that are completely within the area of effect are automatically pushed 10 feet away from that point by the spell’s effect, and the spell emits a thunderous boom audible out to 100 feet. At Higher Levels. When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d8 for each slot level above 3rd.",
    "subclassRestricted": false
  },
  {
    "name": "Flipendo",
    "english_title": "The Knockback Jinx",
    "level": 1,
    "school": "Curse",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "60 feet",
    "duration": "Instantaneous",
    "tags": [],
    "description": "The spell feels like a very heavy blow, sharply throwing a creature from its standing position to the ground. Choose a being you can see within range to make a Strength saving throw. On a failed save, a creature takes 1d10 bludgeoning damage, is knocked back a number of feet equal to five times your spellcasting ability modifier, and is knocked prone. On a successful save, the creature takes half as much damage, is knocked back 5 feet, and isn’t knocked prone. Part 2 | Spells At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d10 and the knockback on a failed save increases by 5 feet for each slot level above 1st.",
    "subclassRestricted": false
  },
  {
    "name": "Immobulus",
    "english_title": "The Freezing Charm",
    "level": 2,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "Self (15 foot cube)",
    "duration": "1 round",
    "tags": [],
    "description": "You send a pulse through the area in front of you, freezing everything in space and time. Roll 7d10; the total is how many hit points of creatures this spell can affect. All creatures and objects in a 15-foot cube originating from you are affected in the order of nearest to farthest. Each creature affected by this spell is paralyzed until the spell ends. While paralyzed, the creature is fixed in the space they occupied when the spell was cast, which may leave it suspended in air. Subtract each creature's current hit points from the total before moving on to another creature. A creature's hit points must be equal to or less than the remaining total for that creature to be affected. Any object that is wholly within the area is automatically affect by this spell for the duration and does not count against the number of hit points you can affect. If casting the spell only affects objects and does not affect any creatures, the duration is up to 8 hours. At Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, roll an additional 2d10 for each slot level above 2nd. When you cast this spell using a spell slot of 4th level or higher, the duration increases by 1 round for each two slot levels above 2nd.",
    "subclassRestricted": false
  },
  {
    "name": "Incarcerous",
    "english_title": "The Binding Spell",
    "level": 2,
    "school": "Transfiguration",
    "ritual": true,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "30 feet",
    "duration": "24 hours",
    "tags": [],
    "description": "Black cords and ropes are conjured and wrap themselves forcefully around a target you can see within range. If the target is an unwilling creature, it must make a Strength saving throw. On a failed save, the creature is restrained for the duration. Upon casting, you can choose to anchor the ropes to the ground, preventing the target from being moved by external forces. The restrained creature or someone else who can reach it can use an action to make a Strength check against your spell save DC. On a success, the restrained effect ends. At Higher Levels. When you cast this spell using a spell slot of 4th level or higher, the creature is also incapacitated, rendering it unable make a Strength check to escape.",
    "subclassRestricted": false
  },
  {
    "name": "Lapifors",
    "english_title": "The Babbitty Rabbitty Spell",
    "level": 4,
    "school": "Transfiguration",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "60 feet",
    "duration": "Concentration, up to 1 hour",
    "tags": ["School of Magic - Transfiguration"],
    "description": "This spell transforms a creature with at least 1 hit point that you can see within range into the form of a rabbit. An unwilling creature must make a Wisdom saving throw to avoid the effect. The transformation lasts for the duration, or until the target drops to 0 hit points or dies. The target's game statistics, including mental ability scores, are replaced by the statistics of a rabbit. It retains its alignment and personality. The HM has the creature's statistics. The target assumes the hit points of its new form. When it reverts to its normal form, the creature returns to the number of hit points it had before it transformed. If it reverts as a result of dropping to 0 hit points, any excess damage carries over to its normal form. As long as the excess damage doesn't reduce the creature's normal form to 0 hit points, it isn't knocked unconscious. The creature is limited in the actions it can perform by the nature of its new form, and it can't speak, cast spells, or take any other action that requires hands or speech. The target's gear melds into the new form. The creature can't activate, use, wield, or otherwise benefit from any of its equipment.",
    "subclassRestricted": true
  },
  {
    "name": "Locomotor Wibbly",
    "english_title": "The Jelly-Legs Jinx",
    "level": 0,
    "school": "Curse",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "60 feet",
    "duration": "Instantaneous",
    "tags": [],
    "description": "This will make a person's legs so unsteady and weak that they aren't able to keep their balance. Make a ranged spell attack against a being within range. On a hit, the target is knocked prone.",
    "subclassRestricted": false
  },
  {
    "name": "Muco Volatilis",
    "english_title": "The Bat-Bogey Hex",
    "level": 4,
    "school": "Curse",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "60 feet",
    "duration": "Concentration, up to 1 minute",
    "tags": [],
    "description": "This terrifying spell transforms the victim's bogies (or boogers) into nasty green bats that crawl out of their nose and attack. Make a ranged spell attack against a being within range. On a hit, the target and any hostile creatures within 5 feet of the target take 6d4 slashing damage. At the start of the target's turn and when any hostile creature starts its turn within 5 feet of the target, it takes 3d4 slashing damage. If any creature has to make a saving throw to maintain concentration because of this spell's damage, the saving throw is made at disadvantage. At Higher Levels. When you cast this spell using a spell slot of 5th level or higher, the initial damage increases by 2d4 for each slot level above 4th.",
    "subclassRestricted": false
  },
  {
    "name": "Obliviate",
    "english_title": "The Memory Charm",
    "level": 5,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "30 feet",
    "duration": "Concentration, up to 1 minute",
    "tags": ["School of Magic - Charms"],
    "description": "You attempt to reshape another being's memories. One being you can see within range must make a Wisdom saving throw. If you are fighting the creature, it has advantage on the saving throw. On a failed save, the target becomes charmed by you for the duration. The charmed target is incapacitated and unaware of its surroundings, though it can still hear you. If it takes any damage or is targeted by another spell, this spell ends, and none of the target's memories are modified. You can eliminate the target's memory of an event or detail (or any individual aspect of that event or detail) that it experienced or perceived within the last 24 hours and that lasted no more than 10 minutes. You must mentally describe or visualize how the memories are affected. The being's mind fills in any gaps in the details of your description. If the spell ends before you have finished describing or visualizing the modified memories, the target’s memory isn’t altered. Otherwise, the modified memories take hold when the spell ends. A modified memory doesn't necessarily affect how a being behaves, particularly if the memory contradicts the creature's natural inclinations, alignment, or beliefs. An illogical modified memory, such as erasing all memory of how they were transported to and from a location, is dismissed by the target, perhaps as a bad dream. The HM might deem a modified memory too nonsensical to affect a being in a significant manner. A vulnera sanentur or obliviate spell cast on the target restores the creature's true memory. At Higher Levels. If you cast this spell using a spell slot of 6th level or higher, you can eliminate the target's memories of an event that took place up to 7 days ago (6th level), 30 days ago (7th level), 1 year ago (8th level), or any time in the creature's past (9th level). Alternatively, you can eliminate a detail or topic in all memories across those same time frames.",
    "subclassRestricted": true
  },
  {
    "name": "Pellucidi Pellis",
    "english_title": "The Disillusionment Charm",
    "level": 2,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "Touch",
    "duration": "Concentration, up to 1 hour",
    "tags": [],
    "description": "With a tap of a wand on the top of the head and a sensation of raw egg being broken where the wand was tapped, a creature becomes invisible until the spell ends. Anything the target is wearing or carrying is invisible as long as it is on the target’s person. The spell ends for a target that attacks or casts a spell. At Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd. The targets must be within 5 feet of each other when you target them.",
    "subclassRestricted": false
  },
  {
    "name": "Point Me",
    "english_title": "The Four-Point Spell",
    "level": 0,
    "school": "Divination",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "Self",
    "duration": "Instantaneous",
    "tags": [],
    "description": "Placing your wand flat in your open palm, this spell picks up the wand and points north, much like a compass. The spell's usefulness is situational, but often grants advantage on Wisdom (Survival) checks to not get lost outdoors.",
    "subclassRestricted": false
  },
  {
    "name": "Repello Muggletum",
    "english_title": "The Muggle-Repelling Charm",
    "level": 4,
    "school": "Charm",
    "ritual": true,
    "concentration": false,
    "dedication": false,
    "casting_time": "10 minutes",
    "range": "Self (60-foot-radius hemisphere)",
    "duration": "8 hours",
    "tags": ["Defensive"],
    "description": "Frequently used around wizarding areas, this charm keeps Muggles away from dangerous situations or overtly magical locations. You enchant an area to suggest a course of activity and magically influence a non-magical human. Upon entering the warded area, the subject must make a Wisdom saving throw at disadvantage. On a failed save, it pursues a course of action that takes it away from the area of the spell. The subject's mind naturally thinks of the best reason to convince itself that it must depart, or barring an actual reason, invents an arbitrary emergency that demands its attention elsewhere. The spell's effect ends when the subject has either attended to the matter they thought of or when the subject has decided to take another course of action that does not involve entering the area of the spell.",
    "subclassRestricted": false
  },
  {
    "name": "Transmogrify",
    "english_title": "The Transmogrifian Torture",
    "level": 5,
    "school": "Transfiguration",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "30 feet",
    "duration": "Concentration, up to 1 minute",
    "tags": ["Dark"],
    "description": "A dark purpose for transfiguration, this tortuous spell slowly rearranges and dissolves a creature's internal organs. A creature you can see within range must make a Constitution saving throw. On a failed save, it takes 2d12 acid damage at the start of each of its turns and is subject to crippling pain. On a successful save, the spell has no effect. While the target is affected by crippling pain, any speed it has can be no higher than 10 feet. The target also has disadvantage on attack rolls and ability checks. Finally, if the target tries to cast a spell, it must first succeed on a Constitution saving throw, or the casting fails and the spell is wasted. A target suffering from this spell can make a Constitution saving throw at the end of each of its turns. On a successful save, the spell ends. At Higher Levels. When you cast this spell using a spell slot of 6th level or higher, the damage increases by 1d12 for each slot level above 5th.",
    "subclassRestricted": false
  },
  {
    "name": "Wingardium Leviosa",
    "english_title": "The Levitation Charm",
    "level": 0,
    "school": "Charm",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "30 feet",
    "duration": "Dedication, up to 1 minute",
    "tags": [],
    "description": "One creature other than yourself or object of your choice that you can see within range rises vertically, up to 20 feet, and remains suspended there for the duration. The spell can levitate a target that weighs up to 100 pounds. An unwilling creature that succeeds on a Constitution saving throw is unaffected. The target can move only by pushing or pulling against a fixed object or surface within reach (such as a wall or a ceiling), which allows it to move as if it were climbing. You can change the target’s altitude by up to 20 feet in either direction on your turn. Otherwise, you can use your action to move the target, which must remain within the spell’s range. If the spell is ended voluntarily, the target floats gently to the ground if it is still aloft. If ended involuntarily, the target immediately drops. At Higher Levels. When you cast this spell using a spell slot of 1st level or higher, the weight limit is increased by 150 pounds for each slot level above 0.",
    "subclassRestricted": false
  },
  {
    "name": "Relashio",
    "english_title": "The Revulsion Jinx",
    "level": 2,
    "school": "Curse",
    "ritual": false,
    "concentration": false,
    "dedication": false,
    "casting_time": "1 action",
    "range": "60 feet",
    "duration": "Instantaneous",
    "tags": [],
    "description": "Casting Time: 1 action Range: 60 feet Duration: Instantaneous This spell forces both living and inanimate targets to release their grip. Choose an object or creature that you can see within range. The object can be a set of manacles, a padlock, chains, or another object that is wrapped around or restraining something. If the target is a creature, it must make a Wisdom saving throw. On a failed save, it must let go of whatever it is restraining. This effect ends any grappled or restrained condition that is being imposed by the target. An object that is secured by a mundane or magical lock or that is stuck becomes unlocked, unstuck, or unbarred. When you cast the spell on an object, a loud rattling or clanking, audible from as far away"
  }
]
